mutants/BM109-no-dirsync-after-the-compaction-output.patch
# id: BM109-no-dirsync-after-the-compaction-output
# blinds: the compaction outputs' NAMES becoming durable before the manifest
#         names them
# covering-lane: cpp-sweep
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THE COMPACTION INSTALL ORDERING, WHICH SECTION 7.5 CALLED ARGUED AND UNSWEPT.
# It is the same defect BM61 plants in the FLUSH path, one operation along -- and
# it exists to answer a different question: not "is this ordering right" but
# "CAN THE SWEEP SEE IT HERE AT ALL".
#
# A crash after the manifest group and before the directory entry is durable
# leaves a manifest naming a file the directory does not have. The Open refuses,
# and the database that recovered every other kill point does not open at all.
#
# It is the class that gives the `compact` regime a MEASURED power rather than a
# green lane: a sweep that visits a path proves the engine recovers there and
# says nothing about whether a defect there would be detected.
--- a/engine-cpp/src/db.cc
+++ b/engine-cpp/src/db.cc
@@ -1349,11 +1349,8 @@
     // tombstones survive but everything they hid is gone. `outputs` is the
     // authority on what was written, never `stats.emitted`.
 
-    // 2. the directory, so every output's NAME is durable. ONCE, after the last
-    //    file: the manifest edit that names them has not been written yet, so
-    //    until step 3 they are all equally invisible.
-    Status s = SyncDir();
-    if (!s.ok()) return s;
+    // BM109: the output files' names are left undurable.
+    Status s = Status::Ok();
 
     // 3. ONE GROUP: the counter, the add, and every delete.
     {
