mutants/BM10-crc-excludes-length.patch
# id: BM10-crc-excludes-length
# blinds: the checksum covering the length field
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The catalogue's BM10, and the one mutation in this catalogue that a reviewer
# would most likely APPROVE. It does not introduce a bug; it aligns us with
# upstream LevelDB, whose header is byte-identical to ours and whose CRC covers
# `type || data` only. A future reader doing exactly this by pattern match is
# the reason DESIGN-B1 section 5.3.3 requires the divergence paragraph to live
# on the helper and not only in a document.
#
# What it costs: a corrupted length field stops being detectable AS a corrupted
# length. Recovery reads a wrong-sized payload, the checksum then fails for the
# wrong reason, and the number of bytes consumed before the failure is a
# function of data recovery has already decided not to trust -- so the failure
# offset is unknown and resync has no sound starting point. Section 5.4's
# discriminator is "does anything structurally valid follow the failure point",
# and it cannot be answered from an unknown point.
--- a/engine-cpp/src/wal/format.cc	2026-08-24 21:02:37
+++ b/engine-cpp/src/wal/format.cc	2026-08-24 21:02:37
@@ -92,10 +92,10 @@
 uint32_t FragmentCrc(uint16_t length, FragmentType type, Slice payload) {
   // length || type || payload. See the header for why the length is in here and
   // what breaks if somebody takes it out.
+  // BM10: reverted to LevelDB's coverage -- type || data, length excluded.
+  (void)length;
   std::string buf;
-  buf.reserve(3 + payload.size());
-  buf.push_back(static_cast<char>(length & 0xff));
-  buf.push_back(static_cast<char>((length >> 8) & 0xff));
+  buf.reserve(1 + payload.size());
   buf.push_back(static_cast<char>(static_cast<uint8_t>(type)));
   buf.append(payload.data(), payload.size());
   return Crc32c(buf.data(), buf.size());
