mutants/BM113-writer-bounds-bypass-the-predicate.patch
# id: BM113-writer-bounds-bypass-the-predicate
# blinds: the writer deciding bounds THROUGH THE SHARED PREDICATE
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# BUG-006, PRESERVED AT THE SITE WHERE IT CAN STILL RECUR.
#
# The first version of this class mutated the shared predicate itself and
# SURVIVED -- correctly, and the survival is a finding rather than a gap. The
# predicate takes a BARE USER KEY, so comparing it against a full internal key
# behaves identically to comparing user keys: the bug is UNREPRESENTABLE
# THROUGH THAT API. A fix that makes a defect inexpressible is stronger than one
# that makes it wrong, and no mutant can assert the difference at that site.
#
# What CAN still recur is a caller building its own internal key and comparing
# for itself -- which is exactly what `TableBuilder` did before the fix, and
# exactly what an inlining or a "why call a helper for two lines" edit would
# reintroduce.
#
# THE CONSEQUENCE IS A PERMANENT REFUSAL RATHER THAN DATA LOSS: the manifest
# records a bound `VerifyTables` does not derive, and the Open fails forever
# after with every byte intact.
--- a/engine-cpp/src/sst/table_builder.cc
+++ b/engine-cpp/src/sst/table_builder.cc
@@ -126,9 +126,11 @@
     smallest_.clear();
     AppendInternalKey(&smallest_, start, tag);
   }
-  if (WidensUpperBound(end, Slice(largest_))) {
-    largest_.clear();
-    AppendInternalKey(&largest_, end, tag);
+  // BM113: the writer compares for itself, as it did before BUG-006 was fixed.
+  std::string hi;
+  AppendInternalKey(&hi, end, tag);
+  if (largest_.empty() || CompareInternalKey(Slice(hi), Slice(largest_)) > 0) {
+    largest_ = hi;
   }
   const SeqNum seq = SeqOfTag(tag);
   if (seq > largest_seq_) largest_seq_ = seq;
