mutants/BM26-restart-count-trusted.patch
# id: BM26-restart-count-trusted
# blinds: the restart array being proven to fit before it is read
# covering-lane: cpp-asan
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# A CORRUPT COUNT IS ALLOWED TO STEER THE READER. The count sits inside the
# block's checksum, so this only bites once the checksum has failed to catch
# something -- which is exactly the case a reader must survive: `entries_end`
# underflows to an enormous size_t and the entry walk runs off the block.
#
# This is section 5.3.3's rule in the second format: a length is checked against
# the space it claims BEFORE anything is read using it. The WAL learned it by
# putting the length inside the CRC; the block learns it by bounding the array.
#
# COVERED BY cpp-asan AND NOT cpp-test, DELIBERATELY. The consequence of
# deleting a bounds check is an out-of-bounds READ, and the lane that sees that
# at the byte it happens is the sanitizer lane. cpp-test would see the same
# defect as a crash somewhere downstream, at a location that depends on the
# allocator -- a red lane either way, but not one that names the defect. The
# distinction matters because a mutant is the SPECIFICATION of what a lane
# catches, and "cpp-test crashes eventually" is not a specification.
--- a/engine-cpp/src/sst/table_format.cc	2026-08-25 01:48:24
+++ b/engine-cpp/src/sst/table_format.cc	2026-08-25 01:48:24
@@ -131,11 +131,8 @@
   // The restart array must fit between the entries and the count. Checked
   // before it is read, so a corrupt count cannot make the reader walk off the
   // block -- the same reason section 5.3.3 put the length inside the CRC.
+  // BM26: the declared count is trusted.
   const std::size_t restart_bytes = static_cast<std::size_t>(count) * 4;
-  if (restart_bytes + 4 + kBlockTrailerBytes > n) {
-    *why = "restart array does not fit in the block";
-    return false;
-  }
   const std::size_t entries_end = n - kBlockTrailerBytes - 4 - restart_bytes;
   for (uint32_t i = 0; i < count; ++i) {
     const uint32_t off = GetU32(p + entries_end + i * 4);
