mutants/BM35-tag-sorts-ascending.patch
# id: BM35-tag-sorts-ascending
# blinds: the tag half of the internal key order being DESCENDING
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The one comparator, made wrong, instead of a caller bypassing it. Sorting
# equal user keys by ASCENDING tag puts the OLDEST version first, so a snapshot
# seek stops at the first version at or below the snapshot and finds the wrong
# one -- with the table, the memtable and every checksum in the file entirely
# intact.
#
# It is a one-line inversion and it reads as a fix: `if (ta > tb) return -1` is
# exactly the line a reviewer normalising comparators would "correct". The
# comment above it exists for that reader, and this mutant is what makes the
# comment load-bearing rather than decorative.
--- a/engine-cpp/src/internal_key.cc	2026-08-25 02:00:49
+++ b/engine-cpp/src/internal_key.cc	2026-08-25 02:00:49
@@ -38,8 +38,9 @@
   const uint64_t tb = ExtractTag(b);
   // DESCENDING. The newest version of a key sorts first; see the header for
   // what a bytewise comparison does here instead, and why it looks fine.
-  if (ta > tb) return -1;
-  if (ta < tb) return 1;
+  // BM35: ascending, so the oldest version of a key sorts first.
+  if (ta < tb) return -1;
+  if (ta > tb) return 1;
   return 0;
 }
 
