mutants/BM104-clause-one-ignores-tombstones.patch
# id: BM104-clause-one-ignores-tombstones
# blinds: clause 1 ACTING on a range tombstone that hides a version
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# ON ITS OWN THIS IS ONLY OVER-KEEPING, WHICH THE CLAIM PERMITS -- and that is
# what makes it worth planting rather than obvious. It becomes a wrong answer
# only in combination with clause 2:
#
#   clause 2 drops a tombstone when nothing observable is below it;
#   that is exactly when every version beneath it is unobservable too;
#   so keeping one and dropping the other RESURRECTS the value.
#
# The two rules have to agree about what a tombstone hides. This is the half
# that would silently stop agreeing -- and the half the harness's own
# `Required()` has computed correctly since B3.5a, so a divergence here is the
# engine disagreeing with the model.
#
# THE CALL IS KEPT AND ITS ANSWER DISCARDED, deliberately: deleting it makes the
# helper unused, -Werror kills the CONTROL lane, and a patch that fails to build
# blinds nothing. A mutant must remove exactly one belief.
--- a/engine-cpp/src/compaction.cc
+++ b/engine-cpp/src/compaction.cc
@@ -164,7 +164,10 @@
       for (SeqNum s : observable) {
         if (s < seq) continue;
         if (s >= newer_seq) break;          // ascending, so nothing later fits
-        if (NewestCoveringTombstone(tombstones, user_key, s) > seq) continue;
+        // BM104: clause 1 does not know about range tombstones. The call is
+        // kept and its ANSWER discarded, so the helper stays used and the
+        // control lane still builds -- the patch must blind one thing.
+        (void)NewestCoveringTombstone(tombstones, user_key, s);
         keep = true;
         break;
       }
