mutants/BM63-write-apply-outside-the-lock.patch
# id: BM63-write-apply-outside-the-lock
# blinds: a Write choosing its WAL and its memtable under ONE lock acquisition
# covering-lane: cpp-tsan
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# B1's shape, restored -- and it was correct in B1, because nothing ever
# replaced the WAL or the memtable. The flush replaces BOTH, so in the gap
# between naming the WAL and applying to the memtable a Write can put its record
# in a log about to be deleted and its data in a memtable the flushed table does
# not contain. A LOST WRITE, with no corruption anywhere and nothing afterwards
# to see.
#
# COVERED BY cpp-tsan, because a lost write is what the race produces and the
# race is what a sanitizer can observe. The harness case that makes it visible
# landed in the same diff that widened kConcurrencyClaim to mention it, which is
# the ruled procedure: the wording tracks the harness and never outruns it.
--- a/engine-cpp/src/db.cc	2026-08-25 03:10:56
+++ b/engine-cpp/src/db.cc	2026-08-25 03:10:56
@@ -406,15 +406,15 @@
       // a translation table inside B4's oracle.
       assigned = ++seq_;
       ops = ExpandAndCollapse(b, CurrentVersionLocked(), assigned - 1, &owned);
-      Status s = wal_->Apply(assigned, ops);
-      if (!s.ok()) {
-        // APPLIES NOTHING, ATOMICALLY. The sequence is consumed either way,
-        // which is legal -- the frozen contract requires monotonicity, not
-        // density -- and is simpler than unwinding a counter two threads can
-        // see.
-        *seq = assigned;
-        return s;
-      }
+    }
+    // BM63: B1's shape -- the lock is released around the WAL append.
+    Status s = wal_->Apply(assigned, ops);
+    if (!s.ok()) {
+      *seq = assigned;
+      return s;
+    }
+    {
+      wal::DbLock lock(mu_);
       for (const wal::Op& op : ops) {
         switch (op.kind) {  // NO default: arm
           case wal::OpKind::kSet:
