mutants/BM106-retire-deletes-while-a-reader-holds.patch
# id: BM106-retire-deletes-while-a-reader-holds
# blinds: a compaction input outliving the compaction while a reader holds it
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THE PRE-B3.6 BEHAVIOUR, PRESERVED AS A CLASS. It is not obviously wrong -- it
# was the engine's behaviour through all of B3.5, and every read still returns
# the right answer, because `table.h` holds the whole image resident so the
# bytes outlive the directory entry.
#
# THAT IS EXACTLY WHY IT IS PLANTED. The answer is right for an accidental
# reason, and GF-25 says only an assertion about the MECHANISM can tell you:
# the covering test asserts THE FILE IS ON DISK, not that the read succeeds.
# A suite of read-through-the-snapshot tests passes against this patch.
#
# What it costs in production is nothing today and everything the day a block is
# read on demand -- which is the first thing a cache does, and is the named
# mover in GF-20's sense.
--- a/engine-cpp/src/db.cc
+++ b/engine-cpp/src/db.cc
@@ -926,8 +926,8 @@
   // this reuses rather than extends. A leaked file is removed by the next Open;
   // a file deleted too early is a wrong answer.
   void RetireTable(const std::shared_ptr<sst::Table>& t) {
-    wal::DbLock lock(mu_);
-    obsolete_.push_back(t);
+    // BM106: the input file is deleted at once, as it was before B3.6.
+    (void)env_->DeleteFile(sst::TablePath(dir_, t->number()));
   }
 
   // Deletes every obsolete file whose last reader has gone. Called where an Env
