mutants/FLOOR-always-suspends.patch
# id: FLOOR-always-suspends
# blinds: the floor suspending ONLY when something suspended it
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# AN UNSATISFIABLE GATE, the shape HARNESS-006 named.
#
# Every run becomes kCharacterizationOnly, so nothing is ever bankable as
# evidence for the recovery contract. Note what does NOT happen: no assertion
# fails, no engine behaviour changes, no lane goes red. The mutation is
# CONSERVATIVE, and conservative is exactly the direction no assertion notices.
#
# Its cost arrives two steps downstream. Section 7.4 condition 3 requires that
# BOTH elements of the two-element recovery set were observed ACROSS THE SWEEP,
# and a sweep whose runs are all structurally uncountable as evidence can never
# satisfy it. Found there, it presents as a gate that will not go green -- and
# the debugging starts in the engine, which is the wrong component.
#
# It was reachable until the audit that followed HARNESS-006, because
# OutcomeFloor had only ever been called with `true`.
--- a/engine-cpp/rig/run_outcome.cc	2026-08-24 22:48:29
+++ b/engine-cpp/rig/run_outcome.cc	2026-08-24 22:48:29
@@ -20,8 +20,8 @@
 }
 
 RunOutcome OutcomeFloor(bool exactness_suspended) {
-  return exactness_suspended ? RunOutcome::kCharacterizationOnly
-                             : RunOutcome::kContractPass;
+  (void)exactness_suspended;
+  return RunOutcome::kCharacterizationOnly;  // FLOOR: everything is suspended
 }
 
 const char* RunOutcomeName(RunOutcome outcome) {
