mutants/VERDICT-normal-is-void.patch
# id: VERDICT-normal-is-void
# blinds: a normal run being banked as a pass
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The same unsatisfiable-gate shape in the cap adjudicator. Every run that broke
# no rule is filed as kVoid -- its own column, never banked, rate tracked like
# inconclusive. The engine is correct, the harness is correct, the arithmetic is
# correct, and the evidence column stays empty forever.
#
# Also reachable until the HARNESS-006 audit: OutcomeForCapVerdict was asserted
# for the two divergences and for kVoid, and never for kNormal.
--- a/engine-cpp/rig/cap_adjudication.cc	2026-08-24 22:48:29
+++ b/engine-cpp/rig/cap_adjudication.cc	2026-08-24 22:48:29
@@ -51,7 +51,7 @@
 
 RunOutcome OutcomeForCapVerdict(CapVerdict v) {
   switch (v) {  // NO default: arm
-    case CapVerdict::kNormal:           return RunOutcome::kContractPass;
+    case CapVerdict::kNormal:           return RunOutcome::kVoid;  // VERDICT
     case CapVerdict::kVoid:             return RunOutcome::kVoid;
     case CapVerdict::kSpuriousTripwire:
     case CapVerdict::kMissingTripwire:
