mutants/BM108-obsolete-never-collected.patch
# id: BM108-obsolete-never-collected
# blinds: an obsolete file being reclaimed once its last reader has gone
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THE OTHER DIRECTION, AND IT IS GF-14's OTHER HALF. Keeping a file forever is
# perfectly safe -- every read is correct, no snapshot loses anything -- and it
# is a disk leak that grows with every compaction until the volume fills.
#
# Without this class, "the file outlives its reader" could be satisfied by an
# engine that never deletes anything at all, and no test would say otherwise.
# A retention claim needs its reclamation half or it is a claim about doing
# nothing.
--- a/engine-cpp/src/db.cc
+++ b/engine-cpp/src/db.cc
@@ -943,6 +943,8 @@
       }
       obsolete_ = std::move(still_held);
     }
+    // BM108: nothing is ever collected.
+    ready.clear();
     if (ready.empty()) return Status::Ok();
     for (const auto& t : ready) {
       const Status s = env_->DeleteFile(sst::TablePath(dir_, t->number()));
