mutants/BM117-in-flight-uncharged.patch
# id: BM117-in-flight-uncharged
# blinds: backpressure counting bytes handed to a Sync that has not returned
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THE DEFECT kBusy WOULD HAVE SHIPPED WITH, had the threshold been charged
# against the obvious counter. Wal::Sync zeroes buffered_bytes_ at the swap and
# then does its I/O with the mutex released; for that entire window the bytes
# are resident, undrained, and counted by nothing. A policy reading only
# buffered_ therefore reports NO BACKLOG exactly while the poller is behind --
# which is the only moment backpressure means anything.
#
# IT IS INVISIBLE TO EVERY SEQUENTIAL TEST. Withhold the poller and buffered_
# alone crosses the threshold, so the patched engine answers correctly; the
# whole of Poller.BackpressureIsOwedAndSignalledWhenThePollerIsWithheld passes
# under it. The window is reachable only from INSIDE a Sync, which the rig
# enters through the promotion hook rather than through a second thread --
# a place rather than a race.
--- a/engine-cpp/src/wal/wal.cc
+++ b/engine-cpp/src/wal/wal.cc
@@ -149,7 +149,6 @@
     // MOVED, NOT DISCARDED. These bytes are still resident and still undrained;
     // they have only changed which counter answers for them.
     charged = buffered_bytes_;
-    in_flight_bytes_ += charged;
     buffered_bytes_ = 0;
     high = high_seq_;
   }
