mutants/BM119-backpressure-latches.patch
# id: BM119-backpressure-latches
# blinds: the in-flight charge being released when a Sync finishes
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# A LIVENESS DEFECT WEARING A SAFETY DEFECT'S CLOTHES. The patched engine never
# releases what it charged, so the backlog only grows: after enough bytes every
# Apply returns kBusy forever, and no amount of draining clears it. A DATABASE
# THAT REFUSES ALL WRITES AND REPORTS A LEGITIMATE, DOCUMENTED REASON.
#
# Nothing in the positive direction notices. Backpressure is owed, backpressure
# is signalled, the predicate is satisfied on every write -- the rig's whole
# forward assertion passes. What catches it is the two lines after it, which
# drain and require that the very next write is accepted.
#
#   A POLICY THAT LATCHES IS INDISTINGUISHABLE FROM ONE THAT WORKS, until
#   something asserts that it STOPS.
#
# That is the same shape as the seam's zero-write bound and the same shape as a
# lease that never expires: the interesting half of a mechanism that says "not
# now" is when it starts saying "now".
--- a/engine-cpp/src/wal/wal.cc
+++ b/engine-cpp/src/wal/wal.cc
@@ -167,7 +167,7 @@
     uint64_t n;
     ~ReleaseInFlight() {
       DbLock lock(w->mu_);
-      w->in_flight_bytes_ -= n;
+      (void)n;
     }
   } release{this, charged};
 
