mutants/BM120-snapshot-pins-nothing.patch
# id: BM120-snapshot-pins-nothing
# blinds: a snapshot reading at the sequence it was TAKEN at
# covering-lane: cpp-cgo
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THE CLASS THAT FLOORS B5.4's CONTENT (GF-26). The version is still pinned, so
# nothing is freed underneath the snapshot and every lifetime property holds;
# only the SEQUENCE is wrong, so the snapshot reads the live database while
# holding a version that guarantees it could have read the old one.
#
# A SNAPSHOT THAT PINS NOTHING PASSES EVERY TEST THAT READS IT IMMEDIATELY,
# which is every snapshot test written before this one. Take, read, close: the
# live state and the pinned state are the same state, and the assertion cannot
# tell them apart. The defect needs a WRITE BETWEEN the take and the read, and
# tens of operations is where it gets interesting -- flushes, compactions and
# range deletes all land in the gap.
#
# The differential workloads take and release snapshots naturally and the
# replay records the model's state at each take: 218 snapshots checked, 183 of
# them spanning a later write. That count is asserted, not observed -- a run
# where the negative direction is never reached fails rather than passing
# quietly, because this mutant is exactly what such a run would miss.
--- a/engine-cpp/src/db.cc
+++ b/engine-cpp/src/db.cc
@@ -853,7 +853,7 @@
   std::unique_ptr<Snapshot> NewSnapshot() override {
     wal::DbLock lock(mu_);
     return std::unique_ptr<Snapshot>(
-        new SnapshotImpl(CurrentVersionLocked(), seq_, snapshots_));
+        new SnapshotImpl(CurrentVersionLocked(), kMaxSeqNum, snapshots_));
   }
 
   Status ApproximateDiskBytes(const Bound& start, const Bound& end,
