mutants/BM15-widen-the-set.patch
# id: BM15-widen-the-set
# blinds: the recovery set being TWO elements and not the group's width
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The catalogue's BM15, and it blinds THE ORACLE rather than the engine -- the
# second half of Amendment A2's pairing, one instrument checking the protocol and
# one checking the instrument.
#
# The oracle starts accepting any batch boundary strictly inside the in-flight
# group. That is exactly what B1-D3(c)'s GROUP_END exists to make impossible:
# without the marker the expected recovery point would be "any of the k batch
# boundaries inside the in-flight group" and ruling 3's comparison would stop
# being an equality. The marker turned a range check into an equality check, and
# this turns it back -- in the oracle, where no engine test would ever notice.
#
# The widened oracle still passes every correct run. It only stops REJECTING the
# incorrect ones, which is why it has to be induced against a synthetic log
# whose in-flight group has an intermediate boundary to offer.
--- a/engine-cpp/rig/exactness_oracle.cc	2026-08-25 00:05:23
+++ b/engine-cpp/rig/exactness_oracle.cc	2026-08-25 00:05:23
@@ -104,7 +104,12 @@
   } else {
     candidates.push_back({MatchedElement::kPreviousGroup, log.previous_group_high()});
     if (facts.in_flight_durability_applied) {
-      candidates.push_back({MatchedElement::kInFlightGroup, log.in_flight_group_high()});
+      // BM15: every batch boundary inside the in-flight group is accepted.
+      for (OracleSeq s : log.write_sequences()) {
+        if (s > log.previous_group_high()) {
+          candidates.push_back({MatchedElement::kInFlightGroup, s});
+        }
+      }
     }
   }
 
