mutants/BM17c-mispointed-callsite.patch
# id: BM17c-mispointed-callsite
# blinds: the binding between a wrapper's declared CallSite and the one it uses
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-scan
# expect-control: alive
#
# NOT IN THE CATALOGUE. It was added because of what BM17a and BM17b revealed
# about the scanner's reach: cpp-scan reads env.h and call_site.h, so it sees
# DECLARATIONS. It cannot see env.cc, so it cannot see which CallSite a wrapper
# actually passes to Intercept. A copy-paste slip there satisfies the 1:1:1
# assertion perfectly and aims a kill point and every injector at the wrong
# call -- silently, and in the direction where the sweep would report visiting a
# site it never visited.
#
# Its control is cpp-scan itself, staying green, which is the demonstration:
# the scan and the behaviour test cover different halves, and this patch is the
# proof that neither half is redundant. Amendment A2 requires a new mutant class
# in the same change as the gap that revealed it; this is that.
--- a/engine-cpp/src/env/env.cc	2026-08-24 19:17:27
+++ b/engine-cpp/src/env/env.cc	2026-08-24 19:17:27
@@ -174,7 +174,7 @@
 }
 
 Status Env::RenameFile(const std::string& from, const std::string& to) {
-  Status s = faults_->Intercept(CallSite::kEnvRenameFile, id_);
+  Status s = faults_->Intercept(CallSite::kEnvCreateDir, id_);
   if (!s.ok()) return s;
   return DoRenameFile(from, to);
 }
