mutants/BM19-spurious-tripwire.patch
# id: BM19-spurious-tripwire
# blinds: cap adjudication, DIRECTION 1 -- the engine tripping on legal input
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The catalogue's BM19, and the direction B1-D8 was OVERRULED to make
# detectable. Revision 2 would have treated a tripwire report as grounds to VOID
# the run -- so an engine that spuriously trips would delete the evidence of its
# own bug, and the oracle would be believing the engine's account of itself.
#
# Under the ruling the harness computes record_bytes from ITS OWN record of what
# it submitted, and a tripwire on input the harness computes as legal is a
# DIVERGENCE that FAILS the run. It does not void. That distinction is the whole
# of the overrule.
#
# Both caps are edited, because section 10.2 assigns this mutant the same
# direction against kWalBufferFull as against kRecordTooLarge.
--- a/engine-cpp/src/wal/wal.cc	2026-08-24 21:15:11
+++ b/engine-cpp/src/wal/wal.cc	2026-08-24 21:15:11
@@ -75,7 +75,7 @@
   // predicate is a sum over the ops it submitted and never has to model
   // fragmentation (section 5.3.4).
   const uint64_t bytes = BatchRecordBytes(ops);
-  if (bytes > caps_.max_record_bytes) {
+  if (bytes > caps_.max_record_bytes / 2) {  // BM19
     // Applies NOTHING, atomically. A partially applied over-cap batch would be
     // a torn write the format cannot represent.
     return Status::RecordTooLarge("record " + std::to_string(bytes) + " > cap " +
@@ -84,7 +84,7 @@
 
   DbLock lock(mu_);
   if (closed_) return Status::InvalidArgument("Apply after Close");
-  if (buffered_bytes_ + bytes > caps_.wal_buffer_bytes) {
+  if (buffered_bytes_ + bytes > caps_.wal_buffer_bytes / 2) {  // BM19
     // A TRIPWIRE, NOT A POLICY. Unbounded growth in a fault-injected harness
     // means an OOM kill, which is the worst possible failure signal because it
     // destroys the run that would have explained it. Status::kBusy as the
