mutants/BM2-accept-torn-tail.patch
# id: BM2-accept-torn-tail
# blinds: groups being committed whole or not at all
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The catalogue's BM2. Recovery applies every record it can read instead of only
# those up to the last GROUP_END, so BATCH records written but never covered by
# a returned Sync become part of the recovered state.
#
# This is the DANGEROUS DIRECTION of the exactness contract, and the one the
# whole group mechanism exists to close. Ruling 3 asks for exactly the state at
# the durable watermark -- INCLUDING the direction where a lagging watermark
# recovers MORE than it promised. A database that recovers more than it promised
# looks healthier than one that recovers exactly right, and every test that only
# checks "did my committed writes survive" passes it.
#
# It is also why a group is the unit of durability, recovery AND promise at
# once: because the three coincide, the set of reachable recovery points equals
# the set of promised watermarks. BM2 breaks the coincidence.
--- a/engine-cpp/src/wal/recovery.cc	2026-08-24 22:16:19
+++ b/engine-cpp/src/wal/recovery.cc	2026-08-24 22:16:19
@@ -162,7 +162,7 @@
     }
 
     uint32_t batches_this_group = 0;
-    for (std::size_t i = 0; i < scan.committed_count; ++i) {
+    for (std::size_t i = 0; i < scan.records.size(); ++i) {  // BM2
       const LogicalRecord& rec = scan.records[i];
       switch (rec.kind) {  // NO default: arm
         case RecordKind::kInvalid:
