mutants/BM21-network-in-build.patch
# id: BM21-network-in-build
# blinds: the property that no lane touches the network (DESIGN-B1 section 9.2)
# covering-lane: cpp-ci
# expect: killed
# control-lane: cpp-vendor-build
# expect-control: alive
#
# BM21 IS ITS OWN CONTROL, and that is why it carries one. The induced failure
# DESIGN-B1 names for it is bidirectional in its own wording -- "it must pass
# with networking available and fail under isolation" -- so a red under
# isolation only means something once the same patched tree has been seen to go
# green with a network. Without that half, a patch that simply broke the build
# would look exactly like a caught mutant.
#
# The control is cpp-vendor-build rather than the whole lane set because the
# FetchContent step runs at CONFIGURE time, so the cheapest lane that configures
# this CMakeLists is a complete control and the expensive one adds nothing.
#
# The SOURCE_SUBDIR names a directory that does not exist, so
# FetchContent_MakeAvailable populates without add_subdirectory. That is not a
# trick to make the mutant pass: it keeps the mutant testing the NETWORK
# property rather than colliding with the vendored gtest targets and failing for
# an unrelated reason in both directions.
--- a/engine-cpp/CMakeLists.txt	2026-08-24 16:53:29
+++ b/engine-cpp/CMakeLists.txt	2026-08-24 16:53:29
@@ -80,6 +80,19 @@
 target_compile_definitions(gtest      PUBLIC GTEST_HAS_EXCEPTIONS=0 GTEST_HAS_RTTI=0)
 target_compile_definitions(gtest_main PUBLIC GTEST_HAS_EXCEPTIONS=0 GTEST_HAS_RTTI=0)
 
+# ---------------------------------------------------- BM21 (injected defect)
+# The realistic mistake: someone decides vendoring is a nuisance and reaches for
+# FetchContent. It works on their machine, and on any machine with a network,
+# which is every machine anyone tries it on.
+include(FetchContent)
+FetchContent_Declare(
+  bm21_gtest
+  GIT_REPOSITORY https://github.com/google/googletest.git
+  GIT_TAG        52eb8108c5bdec04579160ae17225d66034bd723
+  SOURCE_SUBDIR  rift-bm21-no-such-dir
+)
+FetchContent_MakeAvailable(bm21_gtest)
+
 # ------------------------------------------------------------ our own flags
 #
 # -Werror=switch is named explicitly even though -Werror already implies it.
