mutants/BM23-upgrade-the-claim.patch
# id: BM23-upgrade-the-claim
# blinds: the bound on what the TSan lane establishes
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The catalogue's BM23, and the mutation is a SUMMARIZER'S EDIT rather than a
# programmer's: nothing about the harness changed, only the sentence describing
# it. The lane still drives one authored interleaving; TSan still reports the
# races it observes rather than the ones that exist.
#
# Ruled: do not let a future summarizer upgrade this to "race-free". So the
# claim lives in one constant and is pinned by a test, which means strengthening
# the sentence requires failing a test -- and the standing rule is that the
# harness must be strengthened in the SAME DIFF that strengthens the claim. A
# systematic interleaving search would earn a stronger sentence. This does not.
--- a/engine-cpp/src/concurrency_claim.h	2026-08-24 19:37:57
+++ b/engine-cpp/src/concurrency_claim.h	2026-08-24 19:37:57
@@ -26,8 +26,7 @@
 namespace rift {
 
 inline constexpr char kConcurrencyClaim[] =
-    "TSan observed no data race across one authored interleaving pattern "
-    "(concurrent MemTable Add and Get); this is not a proof of race-freedom.";
+    "TSan verified the MemTable is race-free.";
 
 }  // namespace rift
 
