mutants/BM24-index-separator-unchecked.patch
# id: BM24-index-separator-unchecked
# blinds: the index entry equalling the last key of the block it names
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# B2-D2's WHOLE JUSTIFICATION, removed. The decision to store the block's exact
# last key rather than LevelDB's shortest separator was taken because it makes
# the index CHECKABLE against the table it indexes. Delete the check and the
# decision has been paid for and not spent: the index is larger, and nothing
# validates it.
#
# What it costs in production: an index entry that names the wrong block is a
# seek that lands in the wrong place. With the separator merely SEPARATING, that
# is undetectable by construction -- which is the argument for the decision, and
# the reason this mutant exists to defend it.
--- a/engine-cpp/src/sst/table_check.cc	2026-08-25 01:47:26
+++ b/engine-cpp/src/sst/table_check.cc	2026-08-25 01:47:26
@@ -130,11 +130,7 @@
     // there is something in the table to compare it against. A shortened
     // separator -- LevelDB's -- would leave this assertion impossible to write,
     // which is the argument for the decision rather than a consequence of it.
-    if (entries.back().key != ie.key) {
-      return Fail(TableFault::kIndexSeparatorMismatch,
-                  footer.index.offset + ie.offset,
-                  "index names a key that is not the block's last");
-    }
+    // BM24: the separator is not compared against the block it names.
     ok.data_blocks++;
     ok.entries += entries.size();
   }
