mutants/BM27-entries-unordered.patch
# id: BM27-entries-unordered
# blinds: entries being strictly ascending within a data block
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# Order is not decoration in an SSTable: it is the precondition for every merge,
# every binary search and every bloom-negative shortcut built on top. A block
# whose entries are out of order decodes perfectly and answers reads wrongly,
# and the wrongness is a MISSING key rather than a corrupt one -- the failure
# mode nothing downstream is looking for.
#
# STRICTLY ascending, note: two entries with the same user key AND the same tag
# are two versions the merge order cannot distinguish, so equality is refused
# with the same verdict.
--- a/engine-cpp/src/sst/table_check.cc	2026-08-25 02:00:49
+++ b/engine-cpp/src/sst/table_check.cc	2026-08-25 02:00:49
@@ -139,10 +139,7 @@
       // DESCENDING. A bytewise comparison orders two versions of one user key
       // the wrong way round and would accept a table whose readers find the
       // OLDEST visible version at every snapshot seek.
-      if (i > 0 && CompareInternalKey(entries[i].key, entries[i - 1].key) <= 0) {
-        return Fail(TableFault::kEntriesNotAscending, h.offset + entries[i].offset,
-                    "entry key does not exceed the one before it");
-      }
+      // BM27: entries are accepted in whatever order they appear.
     }
     // B2-D2, MADE CHECKABLE. The separator is the block's LAST KEY exactly, so
     // there is something in the table to compare it against. A shortened
