mutants/BM31-version-unchecked.patch
# id: BM31-version-unchecked
# blinds: the format version being refused rather than guessed at
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# A file written by a future build parses as far as its layout happens to
# coincide with this one's and then produces keys. `reserved` exists so that B3
# can change the format WITHOUT a version bump; the version exists for the
# changes that cannot be made that way. Dropping the check makes both mechanisms
# useless at once: there is no longer any way to write a file this build refuses
# on purpose.
--- a/engine-cpp/src/sst/table_check.cc	2026-08-25 01:47:27
+++ b/engine-cpp/src/sst/table_check.cc	2026-08-25 01:47:27
@@ -50,10 +50,7 @@
                              : TableFault::kBadFooterChecksum;
     return Fail(f, footer_at, why);
   }
-  if (footer.format_version != kFormatVersion) {
-    return Fail(TableFault::kUnknownFormatVersion, footer_at,
-                "format version " + std::to_string(footer.format_version));
-  }
+  // BM31: any version is accepted.
 
   // EVERY HANDLE IS RANGE-CHECKED BEFORE IT IS FOLLOWED. The footer is the one
   // structure read without trusting anything else in the file; from here on,
