mutants/BM33-reserved-not-zero.patch
# id: BM33-reserved-not-zero
# blinds: the spent reserve carrying the RANGE OFFSET, and zero when there is none
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# RE-AIMED AT B3.5b, WHEN THE RESERVE WAS SPENT. It used to blind "the eight
# reserved bytes are written zero", which was the property that made them safe
# to spend later. They have now been spent, so the property it guards is the
# successor of that one:
#
#   ZERO WHEN THERE IS NO RANGE BLOCK -- which is what makes every B2-era table
#   decode correctly on this build, as "no range block" rather than as garbage.
#   THE OFFSET WHEN THERE IS ONE -- which is the only way to find the block at
#   all, since its size is derived from where it starts.
#
# Junk here is not a corrupt file: the footer's own CRC is recomputed over it,
# so it validates as a footer and lies about where the range block is. Every
# table this build writes would then name a block that is not there.
--- a/engine-cpp/src/sst/table_format.cc
+++ b/engine-cpp/src/sst/table_format.cc
@@ -55,7 +55,9 @@
   // what every B2-era file already holds -- so a B2 table decodes as "no range
   // block" rather than as a newer format. That is the whole of what the reserve
   // bought, and it worked only because zero was a usable sentinel.
-  PutU64(out, f.range_offset);
+  // BM33: the spent reserve carries junk instead of the range offset.
+  (void)f.range_offset;
+  out->append(8, '\x5A');
   out->append(kMagic, sizeof(kMagic));
   RIFT_CHECK(out->size() - before == kFooterCrcCovers);
   PutU32(out, wal::Crc32c(out->data() + before, kFooterCrcCovers));
