mutants/BM34-classifier-compares-bytes.patch
# id: BM34-classifier-compares-bytes
# blinds: the classifier using the internal key order rather than memcmp
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# A SECOND COMPARATOR APPEARING IN A CALLER. Not a deletion -- a substitution,
# and the most natural one: `Slice::compare` is right there, it is what every
# other ordering check in this tree uses, and on single-version data it agrees
# with the internal order exactly.
#
# It disagrees on ONE input class, which is also the commonest one a real
# database produces: two versions of the same user key. Tags are stored
# little-endian, so bytewise the NEWER version sorts SECOND. This mutant
# therefore does two wrong things at once -- it REFUSES every legal table that
# contains a rewritten key, and it ACCEPTS a table whose readers find the oldest
# visible version at every snapshot seek.
#
# This is the defect the first draft of the classifier actually had. It was
# found by writing the fixtures the format requires rather than the fixtures
# that were convenient, which is the argument for landing the classifier before
# the writer arriving one step earlier than the plan expected it to.
--- a/engine-cpp/src/sst/table_check.cc	2026-08-25 02:00:49
+++ b/engine-cpp/src/sst/table_check.cc	2026-08-25 02:00:49
@@ -100,7 +100,7 @@
                   "index key is " + std::to_string(ie.key.size()) + " bytes");
     }
     if (have_previous_index_key &&
-        CompareInternalKey(ie.key, previous_index_key) <= 0) {
+        ie.key.compare(previous_index_key) <= 0) {  // BM34
       return Fail(TableFault::kIndexNotAscending,
                   footer.index.offset + ie.offset,
                   "index key does not exceed the one before it");
@@ -139,7 +139,7 @@
       // DESCENDING. A bytewise comparison orders two versions of one user key
       // the wrong way round and would accept a table whose readers find the
       // OLDEST visible version at every snapshot seek.
-      if (i > 0 && CompareInternalKey(entries[i].key, entries[i - 1].key) <= 0) {
+      if (i > 0 && entries[i].key.compare(entries[i - 1].key) <= 0) {  // BM34
         return Fail(TableFault::kEntriesNotAscending, h.offset + entries[i].offset,
                     "entry key does not exceed the one before it");
       }
