mutants/BM36-bloom-probe-drift.patch
# id: BM36-bloom-probe-drift
# blinds: the builder and the reader walking ONE probe sequence
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THE SECOND PROBE SEQUENCE APPEARING. Not a deletion: the reader stops calling
# the shared walk and computes the same arithmetic inline, minus the `| 1`. It
# is the most reviewable-looking change in this catalogue -- two lines that
# read like the class they replace.
#
# The consequence is A FALSE NEGATIVE, which is the one thing this filter may
# not produce and the one thing nothing downstream reports: a table skipped is
# a key that was simply never there. No checksum fails, no lookup errors, no
# lane goes red except the one that asserts the safety property EXACTLY, over
# every key of every set. That asymmetry is why section 4's table splits the
# two properties by KIND rather than listing them together.
--- a/engine-cpp/src/sst/bloom.cc	2026-08-25 02:14:45
+++ b/engine-cpp/src/sst/bloom.cc	2026-08-25 02:14:45
@@ -103,9 +103,14 @@
 bool FilterReader::MayContain(Slice user_key) const {
   const uint64_t bits = static_cast<uint64_t>(bits_.size()) * 8;
   if (bits == 0) return true;
-  ProbeWalk walk(BloomHash(user_key), bits);
+  // BM36: the reader walks its own sequence.
+  const uint64_t h = BloomHash(user_key);
+  uint64_t pos_ = static_cast<uint32_t>(h & 0xffffffffu) % bits;
+  const uint64_t step_ = static_cast<uint32_t>(h >> 32) % bits;
   for (uint32_t i = 0; i < probes_; ++i) {
-    const uint64_t pos = walk.Next();
+    const uint64_t pos = pos_;
+    pos_ += step_;
+    if (pos_ >= bits) pos_ -= bits;
     const unsigned char byte = static_cast<unsigned char>(bits_.data()[pos / 8]);
     if ((byte & (1u << (pos % 8))) == 0) return false;
   }
