mutants/BM38-bloom-no-minimum-size.patch
# id: BM38-bloom-no-minimum-size
# blinds: the floor under a filter's size
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# Without the floor, a table with no keys produces a filter of ZERO bytes --
# twelve bytes of trailer and nothing to probe -- and a one-key table produces
# two bytes whose rate is dominated by rounding rather than by the pinned
# bits-per-key. The reader refuses the empty one, so an empty flush would
# produce a table that cannot be opened.
#
# The interesting half is that the SAFETY property survives this mutation
# intact: no false negative is possible in a filter that is merely too small.
# It is caught because the n=0 case is IN the size sweep, which is the
# difference between testing a function and testing its typical input.
--- a/engine-cpp/src/sst/bloom.cc	2026-08-25 02:14:45
+++ b/engine-cpp/src/sst/bloom.cc	2026-08-25 02:14:45
@@ -44,7 +44,7 @@
 
 std::string FilterBuilder::Finish() const {
   std::size_t nbytes = (hashes_.size() * kBitsPerKey + 7) / 8;
-  if (nbytes < kMinFilterBytes) nbytes = kMinFilterBytes;
+  // BM38: no floor.
   std::string out(nbytes, '\0');
   const uint64_t bits = static_cast<uint64_t>(nbytes) * 8;
   for (uint64_t h : hashes_) {
