mutants/BM46-largest-seq-is-the-last-keys.patch
# id: BM46-largest-seq-is-the-last-keys
# blinds: the largest SEQUENCE not being the sequence of the largest KEY
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The two are unrelated, and conflating them reads as obviously correct: the
# entries arrive in ascending key order, so the last one is the largest -- of
# KEY. Sequences run the other way inside a user key and have no order at all
# across different ones.
#
# The number matters because recovery RE-DERIVES it from the table's own keys
# and fails the open if the manifest disagrees (B2-D4 section 5.1 point 2). A
# writer reporting the wrong one puts a number in the manifest that its own
# recovery then refuses -- so the defect surfaces at the next Open, on a
# database that is entirely intact, which is the worst possible place to first
# learn that two quantities were confused.
--- a/engine-cpp/src/sst/table_builder.cc	2026-08-25 02:14:45
+++ b/engine-cpp/src/sst/table_builder.cc	2026-08-25 02:14:45
@@ -30,8 +30,8 @@
 
   last_key_.assign(internal_key.data(), internal_key.size());
   largest_ = last_key_;
-  const SeqNum seq = SeqOfTag(ExtractTag(internal_key));
-  if (seq > largest_seq_) largest_seq_ = seq;
+  // BM46: the last key's sequence.
+  largest_seq_ = SeqOfTag(ExtractTag(internal_key));
   ++entries_;
   ++block_entries_;
 
