mutants/BM48-manifest-accepts-a-wal-batch.patch
# id: BM48-manifest-accepts-a-wal-batch
# blinds: a manifest refusing WAL records
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The two logs share a physical format ON PURPOSE and are told apart by the
# KINDS they hold -- that is what D4(c) buys and it is the entire reason no
# second magic was introduced. Remove one half of the discrimination and a WAL
# opened as a manifest replays as an empty manifest: no error, no tables, and a
# database that has forgotten every SSTable it owns.
--- a/engine-cpp/src/sst/manifest.cc	2026-08-25 02:31:27
+++ b/engine-cpp/src/sst/manifest.cc	2026-08-25 02:31:27
@@ -209,7 +209,7 @@
         // A WAL RECORD IN A MANIFEST. The two logs share a physical format on
         // purpose and are told apart by the kinds they hold; each refuses the
         // other's, and this is one half of that pair.
-        return Status::Corruption(path + ": a WAL batch record in a manifest");
+        break;  // BM48: a WAL batch is tolerated in a manifest
       case wal::RecordKind::kGroupEnd: {
         wal::DecodedGroupEnd g;
         if (!wal::DecodeGroupEnd(Slice(rec.payload), &g)) {
