mutants/BM52-current-parsed-leniently.patch
# id: BM52-current-parsed-leniently
# blinds: CURRENT being parsed strictly
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# CURRENT is the one file in the tree whose entire job is to name another one,
# so a lenient parse is a database that opens the wrong manifest because a byte
# changed. `atoi`-shaped leniency -- take the digits you find, ignore the rest --
# turns "MANIFEST-000012 garbage" into manifest 12 and a truncated CURRENT into
# manifest 0.
--- a/engine-cpp/src/sst/manifest.cc	2026-08-25 02:31:27
+++ b/engine-cpp/src/sst/manifest.cc	2026-08-25 02:31:27
@@ -340,15 +340,13 @@
   Status s = ReadWholeFile(env, CurrentPath(dir), &body);
   if (!s.ok()) return s;
   const std::string prefix = "MANIFEST-";
-  if (body.size() != prefix.size() + 6 + 1 || body.compare(0, prefix.size(), prefix) != 0 ||
-      body[body.size() - 1] != '\n') {
+  // BM52: take whatever digits turn up.
+  if (body.size() < prefix.size() || body.compare(0, prefix.size(), prefix) != 0) {
     return Status::Corruption(CurrentPath(dir) + ": not a manifest name");
   }
   uint64_t n = 0;
-  for (std::size_t i = prefix.size(); i + 1 < body.size(); ++i) {
-    if (body[i] < '0' || body[i] > '9') {
-      return Status::Corruption(CurrentPath(dir) + ": not a manifest name");
-    }
+  for (std::size_t i = prefix.size(); i < body.size(); ++i) {
+    if (body[i] < '0' || body[i] > '9') break;
     n = n * 10 + static_cast<uint64_t>(body[i] - '0');
   }
   *number = n;
