mutants/BM53-wal-accepts-a-manifest-edit.patch
# id: BM53-wal-accepts-a-manifest-edit
# blinds: a WAL refusing manifest records
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# BM48's twin, in the other direction, and it needs its own patch for the
# reason every swallowed error needs its own: a discrimination checked on one
# side has said nothing about the other. A manifest opened as a WAL replays as
# an empty WAL, so recovery reports a watermark of zero and every acknowledged
# write in that log is gone -- with no corruption anywhere.
--- a/engine-cpp/src/wal/recovery.cc	2026-08-25 02:31:27
+++ b/engine-cpp/src/wal/recovery.cc	2026-08-25 02:31:27
@@ -186,10 +186,7 @@
           break;
         }
         case RecordKind::kManifestEdit:
-          // The other half of the pair: a manifest presented as a WAL. The two
-          // logs share a physical format deliberately and are distinguished by
-          // the kinds they hold, so each must refuse the other's.
-          return Status::Corruption(path + ": a manifest edit in a WAL");
+          break;  // BM53: tolerated
         case RecordKind::kGroupEnd: {
           DecodedGroupEnd g;
           if (!DecodeGroupEnd(Slice(rec.payload), &g)) {
