mutants/BM54-counter-below-tables-unchecked.patch
# id: BM54-counter-below-tables-unchecked
# blinds: every file number the manifest names being below its own counter
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The next allocation then collides with a live table, and a collision is not
# an error -- it is NewWritableFile truncating a file the manifest still names,
# so the table is destroyed by the act of creating its replacement.
#
# B2-D5 makes this reachable: `max+1` numbering expires the moment a flushed WAL
# can be deleted, and the counter moves into the manifest. A counter that is
# allowed to sit below the files it hands out numbers for is that move done
# wrong.
--- a/engine-cpp/src/sst/manifest.cc	2026-08-25 02:31:27
+++ b/engine-cpp/src/sst/manifest.cc	2026-08-25 02:31:27
@@ -409,14 +409,7 @@
   // EVERY FILE NUMBER THE MANIFEST NAMES MUST BE BELOW THE COUNTER. Otherwise
   // the next allocation collides with a live table, and the collision is a file
   // silently overwritten rather than an error.
-  for (const auto& entry : state->tables) {
-    if (entry.first >= state->next_file_number) {
-      return Status::Corruption(
-          "manifest names table " + std::to_string(entry.first) +
-          " at or above its own next file number " +
-          std::to_string(state->next_file_number));
-    }
-  }
+  // BM54: the counter is not checked against the files it numbers.
 
   const uint64_t number = state->next_file_number++;
   WritableFilePtr file;
