mutants/BM55-tables-oldest-first.patch
# id: BM55-tables-oldest-first
# blinds: the merge order over SSTables, at the line that carries it
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# NEWEST FIRST IS NOT COSMETIC. A deletion in a newer table must hide a value in
# an older one, and an overwrite must hide the value it replaced. Reverse the
# walk and the database returns the FIRST value a key ever had, forever, with
# every checksum verifying and every table individually perfect.
#
# RE-POINTED AFTER IT SURVIVED. The first version reversed the order the sources
# are handed to `MergedIter`, and every test stayed green -- correctly, because
# the merge orders by KEY and sequences are unique, so there are no ties for
# source order to break and the order it is given is irrelevant. That is a
# meaning #2 survival: A DEFENCE THAT WAS NEVER THERE. The comment beside that
# line claimed the property anyway, which is how the patch came to be aimed at
# it; both are fixed in the same diff as this.
#
# The order is load-bearing on THIS path, where the first table holding the user
# key wins and the walk stops.
--- a/engine-cpp/src/db.cc	2026-08-25 17:03:22
+++ b/engine-cpp/src/db.cc	2026-08-25 17:03:22
@@ -404,7 +404,9 @@
     *value = mem_only.value().ToString();
     return Status::Ok();
   }
-  for (const auto& t : v.tables) {
+  // BM55: oldest first.
+  for (auto rit = v.tables.rbegin(); rit != v.tables.rend(); ++rit) {
+    const auto& t = *rit;
     bool deleted = false;
     bool filtered = false;
     const Status s = t->Get(key, snapshot, value, &deleted, &filtered);
