mutants/BM56-watermark-from-the-wal-only.patch
# id: BM56-watermark-from-the-wal-only
# blinds: the watermark surviving a WAL roll
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The frozen contract says DurableSeq is monotone non-decreasing. Rolling the
# WAL gives the new one a durable sequence of ZERO, so a watermark read from the
# live WAL alone drops to zero at every flush -- and a caller that treats the
# watermark as a promise then believes acknowledged data has become unacknowledged.
#
# It is the shape of BM1 turned inside out: BM1 promises more than is durable,
# this promises less. Both are lies about the same number, and only the first
# loses data -- which is exactly why the second is easy to leave in.
--- a/engine-cpp/src/db.cc	2026-08-25 03:10:38
+++ b/engine-cpp/src/db.cc	2026-08-25 03:10:38
@@ -443,8 +443,7 @@
   // a crash loses it and the promise would have been false.
   wal::SeqNum DurableSeq() const override {
     wal::DbLock lock(mu_);
-    const wal::SeqNum w = wal_->DurableSeq();
-    return w > flushed_through_ ? w : flushed_through_;
+    return wal_->DurableSeq();  // BM56
   }
 
   Status Sync(wal::SeqNum* watermark) override {
