mutants/BM57-deleterange-reads-the-memtable-only.patch
# id: BM57-deleterange-reads-the-memtable-only
# blinds: DeleteRange expanding over the MERGED view
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# B2-D7 section 8, undone. At B1 the expansion read the memtable because the
# memtable was the whole database. At B2 it is not, and an expansion that reads
# only the memtable produces a batch that SUCCEEDS and leaves every flushed key
# in the range exactly where it was.
#
# Nothing reports it. The Write returns ok, the WAL records the point deletes it
# did generate, recovery replays them faithfully, and the range is still there.
--- a/engine-cpp/src/db.cc	2026-08-25 03:10:38
+++ b/engine-cpp/src/db.cc	2026-08-25 03:10:38
@@ -136,8 +136,9 @@
         // Reads memory, not Env. This is the operation most likely to violate
         // "Apply performs no I/O", which is why that assertion is re-made
         // against this path -- and why table.h holds whole SSTables resident.
+        // BM57: the memtable only.
         MergedIter it;
-        v.Build(&it);
+        it.AddMemTable(v.mem.get());
         if (start.bounded()) {
           it.Seek(start.key(), (snapshot << 8) | 1);
         } else {
