mutants/BM6-prng-heights.patch
# id: BM6-prng-heights
# blinds: heights being a pure function of the key
# covering-lane: cpp-scan
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The catalogue's BM6: LevelDB's PRNG height source, restored. Section 10.1 says
# it must be caught by "scan lane (compile) + structural digest", and the scan
# is what catches it FIRST -- <random> in engine scope is a rule violation
# before it is a behaviour change, which is the cheapest possible moment to
# notice.
#
# The digest is the independent second catch, and its teeth are demonstrated
# separately by DIGEST-address-heights, which uses a nondeterminism source the
# scan is not looking for. Two instruments, and the sibling patch exists so that
# neither one's coverage is inferred from the other's.
#
# THIS MUTANT CANNOT EXIST AS A COMMITTED FILE, which is why it is a patch
# applied to a scratch tree: the scope scan rejects <random> in engine-cpp/src
# at scan time, so a committed version of it would redden the lane permanently.
# BM14 is the other one, for the same reason.#
# The patch keeps CountTrailingZeros in use. The first version replaced the call
# outright, which left a static function unreferenced, which -Wunused-function
# -Werror rejects -- so the tree did not compile and the control lane reported
# BROKEN rather than a kill. Fourth time in this catalogue a control has
# separated "the lane caught it" from "the patch did not build".
--- a/engine-cpp/src/memtable/tower.cc	2026-08-24 19:40:09
+++ b/engine-cpp/src/memtable/tower.cc	2026-08-24 19:40:09
@@ -1,5 +1,7 @@
 #include "tower.h"
 
+#include <random>
+
 namespace rift {
 
 uint64_t Fnv1a64(Slice key) {
@@ -22,7 +24,10 @@
 }  // namespace
 
 int TowerHeight(Slice key) {
-  const int ntz = CountTrailingZeros(Fnv1a64(key));
+  static std::mt19937 rng;
+  static std::uniform_int_distribution<int> d(0, 63);
+  (void)key;
+  const int ntz = CountTrailingZeros(static_cast<uint64_t>(1) << d(rng));
   const int h = 1 + (ntz / 2);
   return h < kMaxHeight ? h : kMaxHeight;
 }
