mutants/BM60-wal-deleted-before-the-manifest-edit.patch
# id: BM60-wal-deleted-before-the-manifest-edit
# blinds: B2-D5 step 5 coming after step 3
# covering-lane: cpp-sweep
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# "Reversing 3 and 5 loses data outright" -- B2-D5, in as many words. The WAL a
# table covers is deleted BEFORE the manifest names the table, so a crash in
# between leaves neither: the WAL is gone and the table is an orphan nothing
# refers to. Every record in that WAL is lost, on a database that opens cleanly.
#
# The whole ordering exists for this one pair, and only a lane that kills
# between them can tell the two orders apart.
--- a/engine-cpp/src/db.cc	2026-08-25 03:10:38
+++ b/engine-cpp/src/db.cc	2026-08-25 03:10:38
@@ -620,6 +620,20 @@
     s = SyncDir();
     if (!s.ok()) return s;
 
+    // BM60: the covered WALs are removed before the manifest names the table.
+    {
+      std::vector<std::string> early;
+      if (env_->GetChildren(dir_, &early).ok()) {
+        std::sort(early.begin(), early.end());
+        for (const std::string& name : early) {
+          uint64_t n = 0;
+          if (!ParseWalNumber(name, &n)) continue;
+          if (n >= new_wal_number) continue;
+          (void)env_->DeleteFile(dir_ + "/" + name);
+        }
+        (void)SyncDir();
+      }
+    }
     // 3. the manifest edit, then its own Sync (AppendGroup does both).
     //
     // ONE GROUP, and it must be one group: the table becoming live and the WALs
