mutants/BM61-no-directory-sync-after-the-table.patch
# id: BM61-no-directory-sync-after-the-table
# blinds: the directory sync that makes a new table's NAME durable
# covering-lane: cpp-sweep
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# B2-D5 step 2. Creating a file makes its CONTENT durable on fsync and says
# nothing about its NAME: without the directory sync the entry lives in the page
# cache, and after a power cut the manifest names a table that is not there.
#
# The engine then refuses to open -- which is the correct behaviour and the
# wrong outcome, because the data was never at risk. It is BM4 one file kind
# over, and it needs its own patch for the same reason every swallowed error
# does: a rule checked in one place has said nothing about the others.
--- a/engine-cpp/src/db.cc	2026-08-25 03:10:38
+++ b/engine-cpp/src/db.cc	2026-08-25 03:10:38
@@ -616,9 +616,7 @@
       if (!s.ok()) return s;
     }
 
-    // 2. the directory, so the table's NAME is durable.
-    s = SyncDir();
-    if (!s.ok()) return s;
+    // BM61: the table's name is left in the page cache.
 
     // 3. the manifest edit, then its own Sync (AppendGroup does both).
     //
