mutants/BM66-range-accepts-a-point-tag.patch
# id: BM66-range-accepts-a-point-tag
# blinds: the range block holding only DELETE_RANGE tags
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# A point version in the range block is DATA THAT EXISTS AND IS UNREACHABLE: the
# point path never looks here for it, and the range path treats it as a
# tombstone. So it is simultaneously invisible as a value and destructive as a
# deletion.
#
# The ValueType is the reserved kDeleteRange the WAL's OpKind has carried since
# B1. This patch is what makes that reservation load-bearing rather than
# decorative.
--- a/engine-cpp/src/sst/range_tombstone.cc	2026-08-25 21:12:59
+++ b/engine-cpp/src/sst/range_tombstone.cc	2026-08-25 21:12:59
@@ -109,10 +109,7 @@
     }
     // A POINT VERSION IN THE RANGE BLOCK is data that exists and is unreachable:
     // the point path will never look here for it.
-    if (TypeOfTag(t.tag) != ValueType::kDeletion) {
-      return Fail(RangeFault::kNotADeleteRangeTag, e.offset,
-                  "tag type is not a deletion");
-    }
+    // BM66: any tag type is accepted in the range block.
     if (have_previous) {
       const int c = t.start.compare(previous_start);
       // The block is BINARY-SEARCHED to find the tombstones covering a key. An
