mutants/BM7-drop-close-error.patch
# id: BM7-drop-close-error
# blinds: Close's error reaching the caller
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The catalogue's BM7, and it is AN EXACTNESS-(ii) FAILURE rather than a
# tidiness one. close(2) reports EIO for writeback that FAILED AFTER THE LAST
# Sync -- data the engine has already told the caller is durable, discovered to
# be gone at the only moment anyone will ever be told. Swallowing it means the
# watermark stands for bytes that no longer exist.
#
# Section 3.3 says it in one line: CLOSE IS A WRITE CALL. Treating it as
# bookkeeping is a known way to lose data.
--- a/engine-cpp/src/db.cc	2026-08-25 03:07:35
+++ b/engine-cpp/src/db.cc	2026-08-25 03:07:35
@@ -509,9 +509,10 @@
     // The error is RETURNED, not dropped. close(2) reports EIO for writeback
     // that failed after the last Sync, which is the last moment anyone can
     // learn the data is gone (BM7).
-    const Status w = wal_->Close();
-    const Status m = manifest_ != nullptr ? manifest_->Close() : Status::Ok();
-    return w.ok() ? m : w;
+    // BM7: close(2)'s error is dropped.
+    (void)wal_->Close();
+    if (manifest_ != nullptr) (void)manifest_->Close();
+    return Status::Ok();
   }
 
  private:
