mutants/BM70-concat-accepts-an-overlapping-run.patch
# id: BM70-concat-accepts-an-overlapping-run
# blinds: the run being non-overlapping
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The precondition is what makes the binary search sound: if at most one file
# can hold a key, finding that file is finding the answer. With overlap, the
# search returns the FIRST file whose range admits the key and never looks at
# the second -- so one file's version is returned and another's is hidden, with
# nothing structurally wrong anywhere to report it.
#
# It is a precondition on the CALLER, which is exactly the kind that gets
# violated silently once a compaction is choosing inputs. Asserting it at
# construction is what turns a wrong answer into an abort at the point of the
# mistake.
--- a/engine-cpp/src/sst/concat_iter.cc	2026-08-25 21:30:38
+++ b/engine-cpp/src/sst/concat_iter.cc	2026-08-25 21:30:38
@@ -10,10 +10,7 @@
   // ASCENDING AND NON-OVERLAPPING, ASSERTED AT CONSTRUCTION. An overlapping run
   // returns one file's version of a key and hides another's -- a wrong answer
   // with nothing structurally wrong anywhere to report it.
-  for (std::size_t i = 1; i < run_.size(); ++i) {
-    RIFT_CHECK(CompareInternalKey(Slice(run_[i]->check().smallest_key),
-                                  Slice(run_[i - 1]->check().largest_key)) > 0);
-  }
+  // BM70: the run is trusted.
   file_ = run_.size();
 }
 
