mutants/BM72-level-one-run-unchecked.patch
# id: BM72-level-one-run-unchecked
# blinds: L1 being proven a RUN before anything binary-searches it
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# ConcatIter asserts the same precondition in-process, where an abort is the
# right answer. THIS one is about bytes off disk, where it is not: a process
# that aborts on a damaged file cannot report what is wrong with it, and the
# Open is the last moment anyone can refuse.
#
# Without it a damaged or foreign manifest makes L1FileFor return the first file
# whose range admits the key and never look at the second.
--- a/engine-cpp/src/sst/manifest.cc
+++ b/engine-cpp/src/sst/manifest.cc
@@ -319,16 +319,8 @@ Status VerifyL1IsARun(const ManifestState& state) {
     if (c != 0) return c < 0;
     return a->number < b->number;
   });
-  for (std::size_t i = 1; i < l1.size(); ++i) {
-    const Slice prev_last = ExtractUserKey(Slice(l1[i - 1]->largest));
-    const Slice next_first = ExtractUserKey(Slice(l1[i]->smallest));
-    if (prev_last.compare(next_first) >= 0) {
-      return Status::Corruption(
-          "level 1 is not a run: table " + std::to_string(l1[i - 1]->number) +
-          " ends at a user key at or after where table " +
-          std::to_string(l1[i]->number) + " begins");
-    }
-  }
+  // BM72: whatever the manifest says L1 is, L1 is.
+  (void)l1;
   return Status::Ok();
 }
 
