mutants/BM74-drops-ignore-snapshots.patch
# id: BM74-drops-ignore-snapshots
# blinds: `S` being every LIVE snapshot and not just the newest reader
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# With only the newest reader in S, exactly one version of each key survives --
# which is right whenever nobody holds a snapshot, and is the single most
# plausible way to write this. A snapshot then reads a version that was dropped
# out from under it and gets a NEWER value than it was promised.
#
# It is the drop rule's whole reason for taking S as an argument, and the bug it
# plants leaves a database that is internally consistent and simply missing
# something -- section 1.4's point, which is why a surviving-state check cannot
# find it.
--- a/engine-cpp/src/compaction.cc
+++ b/engine-cpp/src/compaction.cc
@@ -13,8 +13,8 @@ namespace {
 // its own sequence, `hi` is the sequence of the next-newer version (or one past
 // the end of the sequence space, for the newest).
 bool AnyObservableIn(const std::vector<SeqNum>& s, SeqNum lo, SeqNum hi) {
-  const auto it = std::lower_bound(s.begin(), s.end(), lo);
-  return it != s.end() && *it < hi;
+  // BM74: only the newest reader is considered; snapshots are not.
+  return !s.empty() && s.back() >= lo && s.back() < hi;
 }
 
 // Is some observable sequence strictly below `q`? If none is, then no version
