mutants/BM75-tombstone-dropped-when-not-bottom-most.patch
# id: BM75-tombstone-dropped-when-not-bottom-most
# blinds: clause 2's requirement that NOTHING OLDER SURVIVES ANYWHERE
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# This is the resurrection bug, and it is why input selection is a CORRECTNESS
# concern in this engine rather than a policy one. A deletion dropped while an
# older value survives in a file the compaction did not read makes the deleted
# value visible again -- with every file structurally valid, every checksum
# right, and nothing to report.
--- a/engine-cpp/src/compaction.cc
+++ b/engine-cpp/src/compaction.cc
@@ -93,7 +93,9 @@ Status RunCompaction(MergedIter* input, const std::vector<SeqNum>& observable,
       //
       // Without `bottom_most` the tombstone is always kept: an older value in a
       // file this compaction did not read would come back from the dead.
-      keep = !bottom_most || AnyObservableBelow(observable, seq);
+      // BM75: the tombstone is dropped whether or not the inputs are complete.
+      (void)bottom_most;
+      keep = AnyObservableBelow(observable, seq);
     }
 
     // THE WATERMARK PIN. See compaction.h: the output must carry `pin_seq` or
