mutants/BM76-tombstone-dropped-over-a-snapshot.patch
# id: BM76-tombstone-dropped-over-a-snapshot
# blinds: a snapshot BELOW a deletion keeping both it and what it masks
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The other half of clause 2. A snapshot taken before a key was deleted must
# still read the value; dropping the tombstone alone would expose the older
# value to readers ABOVE it, and dropping both would take the value away from
# the snapshot below.
#
# The test that catches it asserts the version survives, which is the direction
# that matters: over-keeping is permitted by the claim, under-keeping is the
# violation.
--- a/engine-cpp/src/compaction.cc
+++ b/engine-cpp/src/compaction.cc
@@ -22,7 +22,10 @@ bool AnyObservableIn(const std::vector<SeqNum>& s, SeqNum lo, SeqNum hi) {
 // older is in keep(k), and clause 2 is satisfied without looking at the older
 // versions at all.
 bool AnyObservableBelow(const std::vector<SeqNum>& s, SeqNum q) {
-  return !s.empty() && s.front() < q;
+  // BM76: nothing is ever below a tombstone.
+  (void)s;
+  (void)q;
+  return false;
 }
 
 }  // namespace
