mutants/BM79-roller-rolls-inside-a-user-key.patch
# id: BM79-roller-rolls-inside-a-user-key
# blinds: a run's files never SHARING a user key
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# Rolling on size alone is the obvious implementation and it breaks the run. Two
# L1 files holding versions of one key means the binary search finds one of them
# and the other's versions are unreachable -- and the unreachable half is
# whichever the search did not land on, so a deletion can stop hiding a value.
#
# It is caught at the next Open by the run check rather than at the roll, which
# is the point of having the invariant stated where bytes are read as well as
# where they are written.
--- a/engine-cpp/src/db.cc
+++ b/engine-cpp/src/db.cc
@@ -781,7 +781,9 @@ class DBImpl final : public DB {
     TableRoller(DBImpl* db, uint64_t max_bytes) : db_(db), max_bytes_(max_bytes) {}
 
     Status Add(Slice internal_key, Slice value, bool boundary) override {
-      if (builder_ != nullptr && boundary && builder_->file_size() >= max_bytes_) {
+      // BM79: the file rolls wherever it happens to be full.
+      (void)boundary;
+      if (builder_ != nullptr && builder_->file_size() >= max_bytes_) {
         const Status s = CloseCurrent();
         if (!s.ok()) return s;
       }
