mutants/BM8-skip-crc.patch
# id: BM8-skip-crc
# blinds: fragment checksum verification at recovery
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The catalogue's BM8. Every fragment is accepted whatever its checksum says, so
# a torn write becomes a record and a flipped byte becomes data. The writer
# still computes and stores the checksums, so the FILE looks correct and only
# the reader has stopped caring -- which means a byte-level inspection of a WAL
# would show nothing wrong at all.
--- a/engine-cpp/src/wal/reader.cc	2026-08-24 21:02:37
+++ b/engine-cpp/src/wal/reader.cc	2026-08-24 21:02:37
@@ -61,10 +61,7 @@
   // the divergence from LevelDB and why reverting it silently weakens the
   // torn-tail rule. Reader and writer call the same helper, so there is one
   // definition of the covered range and not two that can drift.
-  const Slice payload(p + kHeaderBytes, out->length);
-  if (FragmentCrc(out->length, out->type, payload) != out->crc) {
-    return "fragment CRC mismatch";
-  }
+  // BM8: fragment checksums are not verified at recovery.
 
   out->payload = Slice(p + kHeaderBytes, out->length);
   return nullptr;
