mutants/BM81-l1-search-takes-the-wrong-half.patch
# id: BM81-l1-search-takes-the-wrong-half
# blinds: the binary search over the L1 run landing on the right file
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THE PROGRESS ASSERTION STAYS TRUE. `hi - lo` shrinks on both branches, so the
# search still terminates -- cleanly, quickly, and on the wrong file. That is
# GF-12 in one line, and it is why this class carries `covers-correctness:`
# rather than `covered-by:`: what catches it is a READ, not a loop invariant.
#
# BM68 is the same shape one level down, in ConcatIter's seek. Two loops, same
# separation, and the separation is the whole of CF-3's point.
--- a/engine-cpp/src/db.cc
+++ b/engine-cpp/src/db.cc
@@ -119,10 +119,11 @@
   // shrinks.
   while (lo < hi) {
     const std::size_t mid = lo + (hi - lo) / 2;
+    // BM81: the halves are exchanged.
     if (ExtractUserKey(Slice(l1[mid]->check().largest_key)).compare(key) < 0) {
-      lo = mid + 1;
-    } else {
       hi = mid;
+    } else {
+      lo = mid + 1;
     }
   }
   if (lo == l1.size()) return nullptr;
