mutants/BM82-sync-precondition-unguarded.patch
# id: BM82-sync-precondition-unguarded
# blinds: Sync's single-caller precondition being ENFORCED rather than implied
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The precondition was always the contract and was never written down. What B3.4
# changed is what happens when it is broken: until then the manifest had ONE
# appender, and now it has two, and `AppendGroup` takes no lock -- so two
# maintenance paths appending at once interleave records inside one another's
# groups and produce a manifest no reader can replay.
#
# AND THE GUARD THAT LOOKS LIKE IT SERIALISES DOES NOT: `Flush` returns early on
# `imm_ != nullptr`, but `imm_` is set several steps AFTER the first
# AppendGroup, so two concurrent Syncs both pass it. Reading that early-return
# as a serialiser is the trap this class exists to keep visible.
--- a/engine-cpp/src/db.cc
+++ b/engine-cpp/src/db.cc
@@ -634,7 +634,8 @@
     // So the precondition is enforced where it is cheap and exact: a second
     // concurrent caller aborts at the mistake instead of leaving a corrupt
     // manifest for the next Open to refuse.
-    const SingleCaller entered(&in_sync_);
+    // BM82: any number of callers may be inside Sync at once.
+    (void)in_sync_;
 
     // NO LOCK HELD. Everything below makes Env calls, and the mutex-depth guard
     // would fire if one were.
