mutants/BM83-observable-omits-the-visible-sequence.patch
# id: BM83-observable-omits-the-visible-sequence
# blinds: `S` containing the sequence a caller reads at with no snapshot
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THE DANGEROUS MISREADING OF B3-Q2's OWN RULING. "S is the live snapshots
# only" is the ruling; "S is the live snapshots ALONE" is this patch, and the
# difference is the reader who holds no snapshot at all.
#
# With no snapshots held -- the ordinary case -- S is EMPTY, nothing is
# observable, and every version of every key becomes droppable. That is the one
# drop no compaction may ever make, and it produces a database that is
# structurally perfect and empty.
#
# It is planted where the ruling is implemented rather than where it is stated,
# because a ruling's text cannot be mutated and its implementation can.
--- a/engine-cpp/src/db.cc
+++ b/engine-cpp/src/db.cc
@@ -899,7 +899,8 @@
     // the one drop no compaction may ever make. B3-Q2's ruling is "live
     // snapshots only"; reading it as "live snapshots ALONE" is the dangerous
     // misreading, and `BM83` is the mutant that keeps it visible.
-    if (s.empty() || s.back() != seq_) s.push_back(seq_);
+    // BM83: S is the live snapshots ALONE.
+    (void)seq_;
     std::sort(s.begin(), s.end());
     s.erase(std::unique(s.begin(), s.end()), s.end());
     return s;
