mutants/BM86-classifier-ignores-the-range-block.patch
# id: BM86-classifier-ignores-the-range-block
# blinds: range tombstones being VALIDATED at all
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# Every rule B3.2 fixed before the writer existed -- ascending starts, half-open
# bounds, no duplicate start-and-tag, a deletion tag, no value -- reaches a real
# table only through this call. Skip it and the seven refusals still pass their
# own unit tests against hand-built bytes while no file the engine writes or
# reads is ever held to them.
#
# It is the shape GF-1 warns about one level up: a check that exists, is tested,
# and is not WIRED to the thing it is supposed to judge.
--- a/engine-cpp/src/sst/table_check.cc
+++ b/engine-cpp/src/sst/table_check.cc
@@ -174,7 +174,8 @@
   // block's crc32c covers exactly the bytes the derived size names, so any
   // disagreement fails the checksum. B1's CRC-covering-the-length property,
   // reused one format over: corruption the reader REJECTS rather than believes.
-  if (footer.range_offset != 0) {
+  // BM86: a range block is a thing the classifier does not look at.
+  if (false && footer.range_offset != 0) {
     if (footer.range_offset >= footer_at) {
       return Fail(TableFault::kHandleOutOfRange, footer_at,
                   "range block offset runs past the footer");
