mutants/BM87-writer-does-not-widen-bounds.patch
# id: BM87-writer-does-not-widen-bounds
# blinds: a table's recorded bounds admitting its own range tombstones
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# CLAUSE 2 OF THE DROP CLAIM, ARRIVING AS A BOUNDS BUG. The manifest records
# these bounds and COMPACTION CHOOSES ITS INPUTS BY THEM. A tombstone outside
# them is one no compaction ever reads -- so a deletion gets dropped while an
# older value it masked survives in a file nobody looked at, and deleted data
# comes back with every file structurally valid.
#
# It also puts the writer and the classifier into disagreement about the same
# fact, which is what the Open refuses: D4 5.1 point 2 holds the manifest to the
# classifier's derivation, and the two no longer agree.
--- a/engine-cpp/src/sst/table_builder.cc
+++ b/engine-cpp/src/sst/table_builder.cc
@@ -84,18 +84,7 @@
   // The end bound is EXCLUSIVE and is widened to `end` anyway: over-covering
   // costs a file that did not need to be read, UNDER-covering resurrects data.
   // The two directions are not symmetric, so the safe one is taken.
-  std::string lo;
-  AppendInternalKey(&lo, start, tag);
-  if (range_count_ == 1 && entries_ == 0) {
-    smallest_ = lo;
-  } else if (smallest_.empty() || CompareInternalKey(Slice(lo), Slice(smallest_)) < 0) {
-    smallest_ = lo;
-  }
-  std::string hi;
-  AppendInternalKey(&hi, end, tag);
-  if (largest_.empty() || CompareInternalKey(Slice(hi), Slice(largest_)) > 0) {
-    largest_ = hi;
-  }
+  // BM87: the recorded bounds describe the data keys and nothing else.
   const SeqNum seq = SeqOfTag(tag);
   if (seq > largest_seq_) largest_seq_ = seq;
 }
