mutants/BM88-classifier-does-not-widen-bounds.patch
# id: BM88-classifier-does-not-widen-bounds
# blinds: the DERIVED bounds including the tombstones' extent
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The other half of BM87, and the half that does the enforcing. Section 6.1a:
# the requirement is about WHAT THE MANIFEST RECORDS, and it is enforced by the
# classifier deriving bounds that include the tombstones while `VerifyTables`
# holds the manifest to that derivation.
#
# Blind the derivation and the manifest is free to record bounds that do not
# admit a tombstone -- which is exactly BM87's bug, reached from the other
# direction and with nothing left to refuse it.
--- a/engine-cpp/src/sst/table_check.cc
+++ b/engine-cpp/src/sst/table_check.cc
@@ -226,12 +226,7 @@
           CompareInternalKey(Slice(lo), Slice(ok.smallest_key)) < 0) {
         ok.smallest_key = lo;
       }
-      std::string hi;
-      AppendInternalKey(&hi, t.end, t.tag);
-      if (ok.largest_key.empty() ||
-          CompareInternalKey(Slice(hi), Slice(ok.largest_key)) > 0) {
-        ok.largest_key = hi;
-      }
+      // BM88: the derived bounds describe the data keys and nothing else.
       if (t.seq() > ok.largest_seq) ok.largest_seq = t.seq();
     }
   }
