mutants/BM89-sentinel-accepts-end-bytes.patch
# id: BM89-sentinel-accepts-end-bytes
# blinds: there being exactly ONE encoding of "no upper bound"
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# B3-Q4's first condition. Accept a record that claims the sentinel AND carries
# an end and there are now TWO ways to say unbounded -- one of which also says
# something else, and nothing decides which reading wins.
#
# The bytes are not corrupt in any structural sense: the block parses, the
# checksum passes, the tombstone sorts. What is lost is the guarantee that a
# writer and a reader mean the same thing by the same record, which is the only
# guarantee a format has.
--- a/engine-cpp/src/sst/range_tombstone.cc
+++ b/engine-cpp/src/sst/range_tombstone.cc
@@ -107,11 +107,7 @@
       // otherwise is refused -- so "no upper bound" has exactly one encoding and
       // there is no second one to disagree with it.
       t.end_unbounded = true;
-      if (left != 8) {
-        return Fail(RangeFault::kUnboundedEndWithBytes, e.offset,
-                    "end length is the unbounded sentinel and " +
-                        std::to_string(left - 8) + " end bytes follow");
-      }
+      // BM89: a sentinel that carries end bytes is read as unbounded anyway.
     } else {
       if (left < elen) return Fail(RangeFault::kMalformedBlock, e.offset, "end runs past the entry");
       t.end = Slice(p, elen);
