mutants/BM90-unbounded-covers-everything.patch
# id: BM90-unbounded-covers-everything
# blinds: an unbounded END leaving the START inclusive and binding
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THE MISREADING THE NAME INVITES. "Unbounded" is one word and the range has two
# ends; a reader who takes it to mean the whole key space deletes everything
# BELOW the start as well, which is data no DeleteRange ever named.
#
# It passes any test that only checks a key INSIDE the range, which is why the
# covering test asserts a key below the start too. Half a range test is not a
# range test.
--- a/engine-cpp/src/sst/range_tombstone.h
+++ b/engine-cpp/src/sst/range_tombstone.h
@@ -100,8 +100,11 @@
   SeqNum seq() const { return SeqOfTag(tag); }
   // Half-open, and the ONE place this question is answered.
   bool Covers(Slice user_key) const {
+    // BM90: unbounded is read as "covers everything" rather than as
+    // "covers everything above its start".
+    if (end_unbounded) return true;
     if (user_key.compare(start) < 0) return false;
-    return end_unbounded || user_key.compare(end) < 0;
+    return user_key.compare(end) < 0;
   }
 };
 
