mutants/BM93-point-read-equal-sequence-hides.patch
# id: BM93-point-read-equal-sequence-hides
# blinds: `strictly below` in the point read
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THE MODEL'S INTRA-BATCH RULE, IN ONE CHARACTER. Every op in a batch shares one
# sequence, so a Set issued AFTER a DeleteRange that covers it lands at the same
# sequence as the tombstone -- and must survive it. `>=` makes the tombstone win
# and the write vanish.
#
# It is invisible to any workload that puts the two in different batches, which
# is every workload anyone writes by habit.
--- a/engine-cpp/src/db.cc
+++ b/engine-cpp/src/db.cc
@@ -622,7 +622,8 @@
   if (v.imm != nullptr) mem_only.AddMemTable(v.imm.get());
   mem_only.Seek(key, MakeTag(snapshot, ValueType::kValue));
   if (mem_only.Valid() && mem_only.user_key() == key) {
-    if (cover > SeqOfTag(mem_only.tag())) return Status::NotFound("");
+    // BM93: a tombstone at the SAME sequence hides the version too.
+    if (cover >= SeqOfTag(mem_only.tag())) return Status::NotFound("");
     if (TypeOfTag(mem_only.tag()) == ValueType::kDeletion) return Status::NotFound("");
     *value = mem_only.value().ToString();
     return Status::Ok();
