mutants/BM94-iterator-equal-sequence-hides.patch
# id: BM94-iterator-equal-sequence-hides
# blinds: `strictly below` in the iterator's forward walk
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# BM93's character in the OTHER live copy of the rule. Two readers, two spellings
# of one sentence, and nothing but a test comparing them keeps the two in step --
# which is why the covering test reaches both through ONE batch rather than
# asserting each against the rule separately.
--- a/engine-cpp/src/db.cc
+++ b/engine-cpp/src/db.cc
@@ -454,7 +454,8 @@
         // cursor happens to be in: the tombstone need not live where the value
         // does.
         const bool covered =
-            v_.NewestCovering(Slice(k), snapshot_) > SeqOfTag(it_.tag());
+            // BM94: the same one character, in the forward scan.
+            v_.NewestCovering(Slice(k), snapshot_) >= SeqOfTag(it_.tag());
         if (!covered && (it_.tag() & 0xff) != 0) {  // a live, uncovered value
           key_ = k;
           value_ = it_.value().ToString();
