mutants/BM95-memtable-equal-sequence-hides.patch
# id: BM95-memtable-equal-sequence-hides
# blinds: `strictly below` in the copy that is NOT on a read path
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# `MemTable::Get` has no caller in `src/` -- the DB reads memtables through
# `MergedIter` -- so this copy of the rule is exercised only by tests and by
# this lane. It is planted anyway, and the reason is the residual the covering
# test states: the third copy is compared against THE RULE and not against the
# other two, so nothing would notice the DB's two drifting together away from
# it. This mutant is what keeps the third copy from drifting on its own.
--- a/engine-cpp/src/memtable/memtable.cc
+++ b/engine-cpp/src/memtable/memtable.cc
@@ -213,7 +213,8 @@
   // would. STRICTLY above: within one batch every op shares a sequence, and a
   // Set issued after a DeleteRange must survive it -- which is the model's
   // intra-batch rule, and the reason this is `>` and not `>=`.
-  if (NewestCoveringLocked(user_key, snapshot) > SeqOfTag(found_tag)) {
+  // BM95: the third copy, which no DB read path uses.
+  if (NewestCoveringLocked(user_key, snapshot) >= SeqOfTag(found_tag)) {
     return Status::NotFound(user_key.ToString());
   }
   const ValueType type = static_cast<ValueType>(found_tag & 0xff);
