mutants/BM96-cover-asks-only-the-memtables.patch
# id: BM96-cover-asks-only-the-memtables
# blinds: a range tombstone SURVIVING THE FLUSH that writes it into a table
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# A range delete works perfectly until the memtable holding it is flushed, and
# then stops -- silently, with every deleted key returning to visibility at once.
# There is no error, no corrupt file and no failed checksum; the tombstone is on
# disk, valid, and never consulted.
#
# The class exists because the tempting shape of `NewestCovering` is "ask the
# store you are reading", and the memtable is the store a range delete is
# written to.
--- a/engine-cpp/src/db.cc
+++ b/engine-cpp/src/db.cc
@@ -108,13 +108,9 @@
     wal::SeqNum best = mem->NewestCovering(user_key, snapshot);
     if (imm != nullptr) {
       const wal::SeqNum s = imm->NewestCovering(user_key, snapshot);
-      if (s > best) best = s;
-    }
-    // EVERY L0 FILE, because they overlap and any of them may hold it.
-    for (const auto& t : l0) {
-      const wal::SeqNum s = t->NewestCovering(user_key, snapshot);
       if (s > best) best = s;
     }
+    // BM96: only the memtables are asked.
     // L1 IS A RUN, so at most one file's BOUNDS admit the key -- and the bounds
     // include tombstone extents (§6.1a), so the file the search finds is the
     // only one whose finite tombstones can cover it.
