mutants/BM97-cover-skips-the-level-one-file.patch
# id: BM97-cover-skips-the-level-one-file
# blinds: L1 being asked whether it holds a covering tombstone
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# BM96 one level down, and the one that only appears after a compaction has run.
# A range delete survives the flush, survives every read while its table is in
# L0, and stops the moment a compaction moves it to L1 -- so the failure is
# separated from the write by an arbitrary amount of time and by an operation
# the caller never asked for.
--- a/engine-cpp/src/db.cc
+++ b/engine-cpp/src/db.cc
@@ -118,10 +118,7 @@
     // L1 IS A RUN, so at most one file's BOUNDS admit the key -- and the bounds
     // include tombstone extents (§6.1a), so the file the search finds is the
     // only one whose finite tombstones can cover it.
-    if (const sst::Table* t = L1FileFor(l1, user_key)) {
-      const wal::SeqNum s = t->NewestCovering(user_key, snapshot);
-      if (s > best) best = s;
-    }
+    // BM97: L1 is not asked about tombstones.
     // WITH ONE EXCEPTION, AND IT IS THE ONE THE BOUNDS CANNOT DESCRIBE. A
     // tombstone with no upper bound reaches past every finite bound, so its
     // file is not found by a search over bounds. Only the LAST file of the run
