mutants/BM98-flush-drops-the-tombstones.patch
# id: BM98-flush-drops-the-tombstones
# blinds: the flush CARRYING the memtable's range tombstones into the table
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The other half of BM96, and the more dangerous half: BM96 loses the answer,
# this loses THE DATA. The tombstone is not merely unconsulted -- it is never
# written, so the retired memtable takes it with it and no reopen can recover
# it. A range delete acknowledged to the caller disappears at the next flush.
--- a/engine-cpp/src/db.cc
+++ b/engine-cpp/src/db.cc
@@ -1371,14 +1371,7 @@
                   if (a.start != c.start) return a.start < c.start;
                   return a.seq < c.seq;
                 });
-      for (const MemRange& r : ranges) {
-        const uint64_t tag = MakeTag(r.seq, ValueType::kDeletion);
-        if (r.end_unbounded) {
-          b.AddUnboundedRangeTombstone(Slice(r.start), tag);
-        } else {
-          b.AddRangeTombstone(Slice(r.start), Slice(r.end), tag);
-        }
-      }
+      // BM98: the memtable's tombstones are not written out.
       s = b.Finish();
       if (!s.ok()) return s;
       meta.file_bytes = b.file_size();
