mutants/BM99-recovery-drops-the-range.patch
# id: BM99-recovery-drops-the-range
# blinds: replay INSERTING the range tombstone the log carries
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THE CRASH-ONLY HALF, which is exactly the half no ordinary run reaches. A range
# delete applies, is acknowledged, is durable in the WAL -- and does not survive
# the reopen. Every key it covered returns.
#
# It is the reason B3.5's change to section 8.1 is a change to RECOVERY and not
# only to Apply: the log now carries a fact, and something has to read it back.
--- a/engine-cpp/src/wal/recovery.cc
+++ b/engine-cpp/src/wal/recovery.cc
@@ -267,8 +267,7 @@
                 // key, and an empty one never has a legal finite meaning --
                 // an empty or inverted range covers nothing and is dropped
                 // before it is ever written.
-                out->table->AddRangeTombstone(b.seq, op.key, op.value,
-                                              op.value.empty());
+                // BM99: a DELETE_RANGE in the log is replayed as nothing.
                 break;
             }
           }
