mutants/CENSUS-extra-call.patch
# id: CENSUS-extra-call
# blinds: the pinned kill-point census counts
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# An Env call is added and the census table is not updated. Section 9.5 requires
# exactly this to surface: a new Env call nobody swept is otherwise invisible,
# and the census is what makes the change visible instead.
#
# It is also the reason the counts are ASSERTED rather than printed. A run that
# printed "22 kill points" and moved on would print "23" the next day and nobody
# would read either number. A number nobody asserts on is decoration that looks
# like evidence.
--- a/engine-cpp/test/test_env_test.cc	2026-08-24 17:39:55
+++ b/engine-cpp/test/test_env_test.cc	2026-08-24 17:39:55
@@ -338,6 +338,7 @@
   ASSERT_TRUE(env->GetFileSize(kLog, &size).ok());
   bool exists = false;
   ASSERT_TRUE(env->FileExists(kLog, &exists).ok());
+  ASSERT_TRUE(env->FileExists(kLog, &exists).ok());  // CENSUS: an extra call
 
   char scratch[16];
   Slice r;
