mutants/CENSUS-missing-drive.patch
# id: CENSUS-missing-drive
# blinds: the CallSite reachability census
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# A call site stops being exercised by the workload that is supposed to exercise
# every operation. The census must report an unvisited enumerator: a CallSite
# that exists and is never reached is an injector nobody can fire, which is
# A0.7's fire-count argument at the seam instead of at the network.
#
# It patches the TEST, because the census is a property OF the workload and the
# only way to induce its failure is to make the workload incomplete -- the same
# shape as blind-analyzer.sh blinding a rule to prove the rule is checked.
--- a/engine-cpp/test/test_env_test.cc	2026-08-24 17:39:55
+++ b/engine-cpp/test/test_env_test.cc	2026-08-24 17:39:55
@@ -318,7 +318,7 @@
 // this function, the pinned counts below must change with it -- which is what
 // makes "an Env call nobody swept" visible instead of invisible.
 void DriveEveryCallSiteOnce(Env* env) {
-  ASSERT_TRUE(env->CreateDir(kDir).ok());
+  // CENSUS: this call is no longer driven
 
   WritableFilePtr w;
   ASSERT_TRUE(env->NewWritableFile(kLog, &w).ok());
