mutants/DECIDER-direction-unasserted.patch
# id: DECIDER-direction-unasserted
# blinds: a decider's second direction actually being asserted
# covering-lane: cpp-scan
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The other half of the rule. The registry entry is present and well-formed and
# names a test that DOES NOT EXIST -- which is how a direction stops being
# asserted without anyone deleting an assertion: the test is renamed, or moved,
# or was aspirational, and the registry goes on claiming coverage.
#
# It is the same failure mode as an unused hatch in CPP-HATCHES.txt, pointed the
# other way: there a stale line makes a real gap look accounted for, here a stale
# line makes an unasserted direction look asserted.
--- a/engine-cpp/DECIDERS.txt	2026-08-24 23:41:28
+++ b/engine-cpp/DECIDERS.txt	2026-08-24 23:41:28
@@ -38,7 +38,7 @@
 
 SuspendsExactness       | TestEnvRegistry.EveryInjectorIsClassifiedAndOnlyRegistryMembersSuspend | TestEnvRegistry.EveryInjectorIsClassifiedAndOnlyRegistryMembersSuspend
 CountsAsRecoveryEvidence | RunOutcome.ExactlyOneKindCountsAsRecoveryEvidence | RunOutcome.ViolationInconclusiveAndVoidAreNotEvidence
-OutcomeFloor            | RunOutcome.TheFloorSuspendsOnlyWhenSomethingSuspendedIt | RunOutcome.TheFloorSuspendsOnlyWhenSomethingSuspendedIt
+OutcomeFloor            | RunOutcome.TheFloorSuspendsOnlyWhenSomethingSuspendedIt | RunOutcome.ThisTestDoesNotExist
 IsDivergence            | CapAdjudication.BothDivergencesFailTheRunAndNeitherVoidsIt | CapAdjudication.BothDivergencesFailTheRunAndNeitherVoidsIt
 OutcomeForCapVerdict    | CapAdjudication.BothDivergencesFailTheRunAndNeitherVoidsIt | CapAdjudication.BothDivergencesFailTheRunAndNeitherVoidsIt
 AggregateRuns           | Regime.RunsOfOneRegimeAggregate | Regime.RunsOfDifferentRegimesRefuseToAggregate
