mutants/GAPLESS-ignored.patch
# id: GAPLESS-ignored
# blinds: WAL numbering being gapless
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The check section 7.2 step 3 exists to give the directory-sync kill point
# teeth. Without it a lost directory entry is SILENT: a WAL vanishes, the
# numbering has a hole nobody looks at, and recovery replays a prefix it
# believes is complete and reports success.
#
# BM4 plants the cause -- an Open that never makes the entry durable. This
# plants the blindness. Both have to be closed, because the failure only becomes
# visible where they meet: the entry is lost by one and unnoticed by the other,
# and neither alone produces a symptom.
#
# REGENERATED AT B2 AGAINST THE REPLACEMENT. B1's check was that WAL NUMBERING
# was gapless, which was a property of no file ever being deleted; B2 deletes
# flushed WALs, and the check is now that every WAL THE MANIFEST NAMES EXISTS.
# The defect class is unchanged -- a lost directory entry passes unnoticed and
# recovery replays a prefix it cannot prove is complete -- so the patch moved
# to the mechanism that now carries it rather than being retired with the code
# it used to point at. A mutant retired with its check is a class that stops
# being watched.
--- a/engine-cpp/src/wal/recovery.cc	2026-08-25 03:07:58
+++ b/engine-cpp/src/wal/recovery.cc	2026-08-25 03:07:58
@@ -75,13 +75,8 @@
       // creating and a crash in that window left a name with no file -- and
       // that exception is what the kill-point sweep refused, 41 times. The
       // order was inverted instead; see manifest.h.
-      if (std::find(present.begin(), present.end(), n) == present.end()) {
-        return Status::Corruption(
-            LogPath(dir, n) +
-            ": named by the manifest and absent. A missing WAL means a directory "
-            "entry was lost, and recovery cannot replay a prefix it cannot prove "
-            "is complete");
-      }
+      // GAPLESS: a named WAL that is absent is simply skipped.
+      if (std::find(present.begin(), present.end(), n) == present.end()) continue;
       numbers.push_back(n);
     }
     for (uint64_t n : present) {
