mutants/LANE-cpp-tsan.patch
# id: LANE-cpp-tsan
# blinds: nothing -- it races a plain counter inside the harness itself
# covering-lane: cpp-tsan
# expect: killed
# control-lane: cpp-test
# expect-control: alive
#
# THE LANE CANARY, kept deliberately independent of any engine code.
#
# Its first form removed a lock the harness itself held, back when the harness
# had one and there was no engine. B1.5 replaced that harness with one driving a
# real MemTable, and the patch rotted -- correctly, and the lane said so.
#
# It is NOT merged into BM14, though BM14 also reddens cpp-tsan. BM14 asks "does
# the ENGINE still hold its lock"; this asks "can this lane report a race AT
# ALL". Those degrade independently: a refactor that moved the memtable's
# locking somewhere BM14's anchor no longer names would take the only
# demonstration of the lane's liveness with it, and the lane would go on being
# green for a subject it had stopped watching. Track A lost five checklist steps
# to exactly that shape.
#
# The control works because cpp-test BUILDS the harness and does not RUN it, so
# the patch is shown to compile and cpp-tsan's red is the race.
--- a/engine-cpp/test/tsan_harness_test.cc	2026-08-24 19:58:14
+++ b/engine-cpp/test/tsan_harness_test.cc	2026-08-24 19:58:14
@@ -46,16 +46,18 @@
   std::printf("  claim: %s\n", kConcurrencyClaim);
 
   MemTable m;
+  long racy = 0;  // LANE: shared, unsynchronized, on purpose
   std::atomic<uint64_t> next_seq{1};
   std::vector<std::thread> threads;
   threads.reserve(kWriters + kReaders);
 
   for (int w = 0; w < kWriters; ++w) {
-    threads.emplace_back([&m, &next_seq, w] {
+    threads.emplace_back([&m, &next_seq, &racy, w] {
       for (int i = 0; i < kOpsPerThread; ++i) {
         const std::string k = KeyAt(w * 7919 + i);
         const std::string v = "v" + std::to_string(i);
         m.Add(next_seq.fetch_add(1), ValueType::kValue, Slice(k), Slice(v));
+        ++racy;
       }
     });
   }
@@ -75,6 +77,7 @@
   // flaky, which is how a concurrency lane earns a retry loop and stops meaning
   // anything. TSan is the observer here; the assertion is only that the writers
   // all landed.
+  EXPECT_GE(racy, 0);
   EXPECT_EQ(m.Count(), static_cast<std::size_t>(kWriters) * kOpsPerThread);
 }
 
