mutants/LEDGER-always-promoted.patch
# id: LEDGER-always-promoted
# blinds: the ledger recording what happened rather than what was reported
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# The ledger starts agreeing with the Sync's RETURN VALUE instead of with the
# promotion that did or did not happen. A lying Sync then appears in the ledger
# as a successful one, and the oracle -- which is required to derive its verdict
# from the ledger and from nothing else -- would be reading the engine's account
# of itself through a harness-shaped hole. "An oracle that interrogates the
# engine believes the lie", arriving by way of the ledger.
#
# The patch changes the CALL SITE rather than the assignment inside
# RecordPromotion. Hardcoding the assignment leaves the `promoted` parameter
# unused, which -Wunused-parameter -Werror rejects, and the control lane
# reported BROKEN instead of a kill -- the third time in this catalogue that a
# control has separated "the lane caught it" from "the patch did not compile".
--- a/engine-cpp/src/env/test/test_env.cc	2026-08-24 17:42:00
+++ b/engine-cpp/src/env/test/test_env.cc	2026-08-24 17:42:00
@@ -378,7 +378,7 @@
     // The ledger records what actually happened, never what was reported: a
     // lying Sync leaves promoted=false beside a call that returned OK, and that
     // disagreement is the entire content of the injector.
-    impl_->RecordPromotion(path_, f == nullptr ? 0 : f->durable.size(), !lied);
+    impl_->RecordPromotion(path_, f == nullptr ? 0 : f->durable.size(), true);  // LEDGER
     return Status::Ok();
   }
   Status DoClose() override { impl_->Flush(path_); return Status::Ok(); }
