mutants/MODEL-flush-promotes.patch
# id: MODEL-flush-promotes
# blinds: the distinction between written and durable
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THRESHOLD 3, INDUCED. Flush advances the durable image, so `durable` stops
# meaning "what a kill would leave" and starts meaning "what was written". This
# is the collapse the content/durable split exists to prevent, and it is the
# shape of B1-D2's REJECTED candidate (a): under a model where durable tracks
# content, an unsynced write is never lost, the entire unsynced window becomes
# untestable, and an engine that never called Sync at all would pass every test
# in the suite -- green, and worth nothing.
--- a/engine-cpp/src/env/test/test_env.cc	2026-08-24 17:35:57
+++ b/engine-cpp/src/env/test/test_env.cc	2026-08-24 17:35:57
@@ -217,6 +217,7 @@
     if (f == nullptr) return;
     f->content += f->buf;
     f->buf.clear();
+    f->durable = f->content;  // MODEL: Flush promotes
   }
 
   void TornFlush(const std::string& path, uint64_t prefix) {
