mutants/ORACLE-includes-engine.patch
# id: ORACLE-includes-engine
# blinds: the oracle being unable to reach engine state
# covering-lane: cpp-scan
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# Section 7.4 condition 1 says the oracle is "compiled against a header that
# does not include the engine's internal state at all". That is a statement
# about includes, so it is checkable -- and this is what makes it checked rather
# than believed.
#
# The patch adds one include. Nothing breaks, nothing goes red anywhere else,
# and the oracle can now reach the DB, the memtable, the WAL and the recovery
# path. It would not USE them today. It would simply become possible for the
# next edit to, and ruling 4's sentence -- AN ORACLE THAT INTERROGATES THE
# ENGINE BELIEVES THE LIE -- would go back to being a thing somebody has to
# remember while typing.
--- a/engine-cpp/rig/exactness_oracle.h	2026-08-25 00:10:45
+++ b/engine-cpp/rig/exactness_oracle.h	2026-08-25 00:10:45
@@ -45,6 +45,7 @@
 #include <string>
 #include <vector>
 
+#include "db.h"  // ORACLE: engine state, reachable from the oracle
 #include "run_outcome.h"
 
 namespace rift {
