mutants/READER-shows-a-dropped-record.patch
# id: READER-shows-a-dropped-record
# blinds: the drop checker's third direction -- survived <= submitted
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THE ALIASING CONDITION, IN THE DIRECTION THAT DECIDES IT. B3-Q1 permits the
# drop checker to parse the engine's artifacts with the engine's own decoder,
# and the cost is a blind spot the two share at exactly the place the checker
# exists to watch.
#
# ANSH'S CONDITION NAMED THE OTHER DIRECTION AND WAS AMENDED. A reader that
# HIDES a record makes `survived` lose something `required` still demands: a
# FALSE VIOLATION, loud and self-announcing. A reader that SHOWS a record the
# bytes do not contain makes a real drop look survived: a FALSE PASS. This is
# that one, and if it survives, the shared parser is unacceptable and the rig
# needs its own.
#
# IT IS A PROBE RATHER THAN A PLAUSIBLE BUG, and that is deliberate. The
# question is not whether this exact defect is likely; it is whether the
# adjudicator can see fabrication AT ALL. A probe that no assertion catches is
# the same finding whether or not a real bug would look like it.
#
# The third direction -- `survived <= submitted` -- was added to the adjudicator
# in the diff that landed this patch, because directions one and two both ask
# whether something is MISSING and neither can see a record that should not be
# there.
--- a/engine-cpp/src/sst/table_format.cc	2026-08-25 19:02:43
+++ b/engine-cpp/src/sst/table_format.cc	2026-08-25 19:02:43
@@ -163,6 +163,29 @@
     e.value = Slice(p + pos, vlen);
     pos += vlen;
     entries->push_back(e);
+    // READER-shows-a-dropped-record: report a version one sequence older than
+    // the one that is really here. The bytes are borrowed from the real entry,
+    // so it parses; only its TAG is fabricated.
+    if (e.key.size() >= 8) {
+      BlockEntry phantom = e;
+      static std::string fabricated;
+      fabricated.assign(e.key.data(), e.key.size());
+      uint64_t tag = 0;
+      for (int i = 0; i < 8; ++i) {
+        tag |= static_cast<uint64_t>(
+                   static_cast<unsigned char>(fabricated[fabricated.size() - 8 + i]))
+               << (8 * i);
+      }
+      if ((tag >> 8) > 1) {
+        tag -= 256;
+        for (int i = 0; i < 8; ++i) {
+          fabricated[fabricated.size() - 8 + i] =
+              static_cast<char>((tag >> (8 * i)) & 0xff);
+        }
+        phantom.key = Slice(fabricated);
+        entries->push_back(phantom);
+      }
+    }
   }
   return true;
 }
