mutants/REGISTRY-lying-sync-not-suspending.patch
# id: REGISTRY-lying-sync-not-suspending
# blinds: the exactness-suspending injector registry
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# kLyingSync drops out of the registry. A run in which the device returned
# success and promoted nothing would then be reportable as kContractPass and
# banked as evidence for the recovery contract -- a contract that run did not
# test, because assertion (ii) should have been suspended for it.
#
# This is BM13's failure arriving from the other end: BM13 breaks the policy
# site that decides what may be banked; this breaks the FACT that site consumes.
# Both have to be closed or the suppression is only as good as whichever half
# nobody edited.
#
# Regenerated at B1.7b, when the torn-Sync injector was SPLIT: prefix
# granularity is B1-D5's contract model and does not suspend, and only the
# sector-subset mode does. The registry still has exactly two members, and this
# patch removes one of them.
--- a/engine-cpp/src/env/test/test_env.cc	2026-08-24 22:25:23
+++ b/engine-cpp/src/env/test/test_env.cc	2026-08-24 22:25:23
@@ -43,9 +43,9 @@
   // characterization-only: conservative, and wrong, and it would have made the
   // two-element set untestable as evidence at B1.9a.
   switch (injection) {  // NO default: arm -- a new injector must be classified
-    case Injection::kSyncLoss:
     case Injection::kSectorSubsetTornSync:
       return true;
+    case Injection::kSyncLoss:  // REGISTRY: no longer suspends
     case Injection::kNone:
     case Injection::kIoError:
     case Injection::kDiskFull:
