mutants/SCAN-raw-syscall.patch
# id: SCAN-raw-syscall
# blinds: nothing -- it plants a syscall outside env/posix/
# covering-lane: cpp-scan
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THE INDUCED FAILURE DESIGN-B1 SECTION 14.2 NAMES FOR B1.4: plant a raw ::open
# in an engine source and the lane must fail.
#
# It compiles, it links, every test passes, and the call is invisible to the
# Env seam -- so it is not a kill point, no injector can reach it, and Amendment
# A5's "every syscall on the C++ side through Env" is false with nothing
# anywhere saying so. That sentence is one of the six in engine-cpp/CLAIMS.txt.
--- a/engine-cpp/src/env/env.cc	2026-08-24 18:55:56
+++ b/engine-cpp/src/env/env.cc	2026-08-24 18:55:56
@@ -1,5 +1,7 @@
 #include "env.h"
 
+#include <fcntl.h>
+
 #include <utility>
 
 namespace rift {
@@ -192,6 +194,8 @@
 }
 
 Status Env::UnlockFile(FileLockPtr lock) {
+  int fd = ::open("/dev/null", O_RDONLY);  // SCAN: a syscall that never went through Env
+  (void)fd;
   Status s = faults_->Intercept(CallSite::kEnvUnlockFile, id_);
   if (!s.ok()) return s;
   return DoUnlockFile(std::move(lock));
