mutants/SCAN-unused-hatch.patch
# id: SCAN-unused-hatch
# blinds: nothing -- it adds a registry entry that matches no violation
# covering-lane: cpp-scan
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# THE SECOND INDUCED FAILURE B1.4 NAMES: add an unused registry entry and the
# lane must fail. No dead hatches.
#
# The entry is perfectly well-formed. It carries a valid split label naming an
# instrument that exists. It exempts a violation that is not there -- because
# the code moved, or because the rule stopped firing, and the registry cannot
# tell those apart and neither can a reader.
#
# That is worse than no hatch at all. The registry is read as the list of known
# gaps, so a stale line makes a REAL gap look accounted for. The Go side's
# HATCHES.txt carries the same rule for the same reason: a drifted hatch means
# something is unguarded while its author believes otherwise.
--- a/engine-cpp/CPP-HATCHES.txt	2026-08-24 18:55:56
+++ b/engine-cpp/CPP-HATCHES.txt	2026-08-24 18:55:56
@@ -36,6 +36,7 @@
 # the exempted line un-registers it and forces the exemption to be re-argued,
 # which is the sensitivity we want.
 
+A5-CLOCK | engine-cpp/src/status.cc | auto now = steady_clock::now(); | covered-by: engine-cpp/test/status_test.cc
 A5-SYSCALL | engine-cpp/src/env/test/test_env.cc | ::_exit(kRealExitStatus); | covered-by: engine-cpp/test/real_exit_kill_test.cc RealExitKill.MatchesTheInProcessKillOnTheSameWorkloadAndKillPoint
 
 POSIX-THIN-LINES | engine-cpp/src/env/posix/posix_raw.cc | Status WriteFully(int fd, const char* data, std::size_t n, RawWriteFn raw) | covered-by: engine-cpp/test/posix_raw_test.cc RawWriteTest (5 tests: one-byte writes, varying short counts, EINTR, bounded zero returns, zero returns that make progress)
