mutants/SEAM-eintr-is-fatal.patch
# id: SEAM-eintr-is-fatal
# blinds: EINTR being a retry rather than a failure
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# An interrupted write becomes a reported IO error. EINTR means nothing
# happened and the call should be repeated; turning it into an error turns a
# signal into a lost write. B5 puts a poller thread in this process, so signals
# stop being hypothetical exactly when the WAL starts mattering.
#
# NOT A CATALOGUE MUTANT. DESIGN-B1 section 14.2 records "Mutants: none" for
# B1.2b, and that is a statement about the BM catalogue: PosixEnv is outside the
# fault matrix, so it gets no BM number. But the standing rule is that no gate
# counts until its failure has been induced and observed, and B1.2b's gates are
# the three seam tests. This patch is that induction, made repeatable rather
# than performed once by hand -- there is no CI here, so an induction nobody can
# re-run is an induction that decays into a sentence in a commit message.
--- a/engine-cpp/src/env/posix/posix_raw.cc	2026-08-24 17:16:49
+++ b/engine-cpp/src/env/posix/posix_raw.cc	2026-08-24 17:16:49
@@ -18,7 +18,7 @@
   while (done < n) {
     const ssize_t w = raw(fd, data + done, n - done);
     if (w < 0) {
-      if (errno == EINTR) continue;  // not a failure; the call was interrupted
+      // SEAM: EINTR is reported as an IO error
       return Status::IoError("write: errno " + std::to_string(errno));
     }
     if (w == 0) {
