mutants/WATERMARK-inferred.patch
# id: WATERMARK-inferred
# blinds: the watermark being READ from GROUP_END rather than inferred
# covering-lane: cpp-test
# expect: killed
# control-lane: cpp-build
# expect-control: alive
#
# NOT IN THE CATALOGUE. It exists because Track A's BUG-005 was a watermark
# inferred from the shape of a structure rather than read from where it was
# written, AND IT COST THREE CYCLES.
#
# The mutation is invisible in every log this engine produces. The writer always
# emits a GROUP_END whose high_seq equals the last batch's sequence, so the
# recorded field and the inferred maximum are ALWAYS EQUAL in real data. Every
# round-trip test, every crash test, every differential run agrees.
#
# It is caught only by a probe image in which the two deliberately differ, which
# no writer can produce and only a hand-built fixture can. That is the whole
# lesson: a value that is inferred rather than read is indistinguishable from a
# correct one until the day the inference's premise stops holding -- at B2, when
# a flushed WAL is deleted and the sequences a file contains stop being the
# sequences it is responsible for.
--- a/engine-cpp/src/wal/recovery.cc	2026-08-24 22:16:58
+++ b/engine-cpp/src/wal/recovery.cc	2026-08-24 22:16:58
@@ -162,6 +162,7 @@
     }
 
     uint32_t batches_this_group = 0;
+    SeqNum highest_batch_seq = 0;  // WATERMARK: inferred, not read
     for (std::size_t i = 0; i < scan.committed_count; ++i) {
       const LogicalRecord& rec = scan.records[i];
       switch (rec.kind) {  // NO default: arm
@@ -195,6 +196,7 @@
                 return Status::Corruption(path + ": DELETE_RANGE is reserved until B3");
             }
           }
+          if (b.seq > highest_batch_seq) highest_batch_seq = b.seq;
           ++batches_this_group;
           ++out->committed_batches;
           break;
@@ -224,7 +226,7 @@
                 path + ": GROUP_END sequence " + std::to_string(g.high_seq) +
                 " goes backwards from " + std::to_string(out->recovered_seq));
           }
-          out->recovered_seq = g.high_seq;
+          out->recovered_seq = highest_batch_seq;  // WATERMARK: inferred
           break;
         }
       }
